#pragma once
#include <cstdint>
#include "AActor.hpp"
class UStaticMeshComponent;
class USceneComponent;
#pragma pack(push, 1)
class ABP_BroomRace_ActivityPad_Gate_C : public AActor {
public:
    UStaticMeshComponent* StaticMeshComponent17; // 0x248
    UStaticMeshComponent* StaticMeshComponent16; // 0x250
    UStaticMeshComponent* StaticMeshComponent15; // 0x258
    UStaticMeshComponent* StaticMeshComponent14; // 0x260
    UStaticMeshComponent* StaticMeshComponent13; // 0x268
    UStaticMeshComponent* StaticMeshComponent12; // 0x270
    UStaticMeshComponent* StaticMeshComponent11; // 0x278
    UStaticMeshComponent* StaticMeshComponent10; // 0x280
    UStaticMeshComponent* StaticMeshComponent9; // 0x288
    UStaticMeshComponent* StaticMeshComponent8; // 0x290
    UStaticMeshComponent* StaticMeshComponent7; // 0x298
    UStaticMeshComponent* StaticMeshComponent6; // 0x2a0
    UStaticMeshComponent* StaticMeshComponent5; // 0x2a8
    UStaticMeshComponent* StaticMeshComponent4; // 0x2b0
    UStaticMeshComponent* StaticMeshComponent3; // 0x2b8
    UStaticMeshComponent* StaticMeshComponent2; // 0x2c0
    UStaticMeshComponent* StaticMeshComponent1; // 0x2c8
    UStaticMeshComponent* StaticMeshComponent0; // 0x2d0
    USceneComponent* SharedRoot; // 0x2d8
    static ABP_BroomRace_ActivityPad_Gate_C* StaticClass();
}; // Size: 0x2e0
#pragma pack(pop)
