#pragma once
#include <cstdint>
#include "AActor.hpp"
class UStaticMeshComponent;
class UMaterialBillboardComponent;
class USceneComponent;
#pragma pack(push, 1)
class ABP_Sanc_HubCornerBookshelfs_03_Dwiz_Dressing05_C : public AActor {
public:
    UStaticMeshComponent* SM_Sanc_LBookRow_Large_A1; // 0x248
    UStaticMeshComponent* SM_HW_DAO_HandBox_A; // 0x250
    UStaticMeshComponent* SM_HW_DAO_CreepyFrame_A; // 0x258
    UStaticMeshComponent* StaticMesh19; // 0x260
    UStaticMeshComponent* StaticMesh17; // 0x268
    UStaticMeshComponent* SM_HW_DAO_DriedMerman1; // 0x270
    UStaticMeshComponent* StaticMesh6; // 0x278
    UMaterialBillboardComponent* MaterialBillboard17; // 0x280
    UStaticMeshComponent* StaticMeshComponent06; // 0x288
    UStaticMeshComponent* SM_Sanc_SkullJar_Dwiz_01A; // 0x290
    UStaticMeshComponent* SM_Sanc_LBookRow_Large_A2; // 0x298
    UStaticMeshComponent* StaticMesh15; // 0x2a0
    UStaticMeshComponent* StaticMesh14; // 0x2a8
    UStaticMeshComponent* StaticMesh7; // 0x2b0
    UStaticMeshComponent* SM_Sanc_LBookRow_Large_A; // 0x2b8
    UStaticMeshComponent* SM_Sanc_CurtainDrapes_02_Dwiz; // 0x2c0
    UStaticMeshComponent* SM_Sanc_Curtains_02_Dwiz1; // 0x2c8
    UStaticMeshComponent* SM_Sanc_Curtains_02_Dwiz; // 0x2d0
    UStaticMeshComponent* SM_Sanc_ColumnSmall_01_Dwiz1; // 0x2d8
    UStaticMeshComponent* StaticMeshComponent027; // 0x2e0
    USceneComponent* SceneRoot; // 0x2e8
    static ABP_Sanc_HubCornerBookshelfs_03_Dwiz_Dressing05_C* StaticClass();
}; // Size: 0x2f0
#pragma pack(pop)
