#pragma once
#include <cstdint>
#include "ABP_TransfigurationMovementStyle_Base_C.hpp"
#include "ETimelineDirection\Type.hpp"
#include "E_PreviewActorState\Type.hpp"
#include "FHitResult.hpp"
#include "FPointerToUberGraphFrame.hpp"
#include "FRotator.hpp"
#include "FTransform.hpp"
#include "FVector.hpp"
class ABP_TransfigurationPreviewPlacementAnimator_C;
class UStaticMeshComponent;
class UDecalComponent;
class APlayerCameraManager;
class USceneComponent;
class UTimelineComponent;
class UMaterialInterface;
class ABP_TransfigurationPreviewActor_C;
class UPrimitiveComponent;
class AActor;
class UAnimInstance;
class UABP_TransfigurationPlaceDown_C;
#pragma pack(push, 1)
class ABP_TransfigurationMovementStyle_DefaultGround_C : public ABP_TransfigurationMovementStyle_Base_C {
public:
    UDecalComponent* RegionDecal9; // 0x5f0
    UDecalComponent* RegionDecal8; // 0x5f8
    UDecalComponent* RegionDecal7; // 0x600
    UDecalComponent* RegionDecal6; // 0x608
    UDecalComponent* RegionDecal5; // 0x610
    UDecalComponent* RegionDecal4; // 0x618
    UDecalComponent* RegionDecal3; // 0x620
    UDecalComponent* RegionDecal2; // 0x628
    UDecalComponent* RegionDecal1; // 0x630
    USceneComponent* Region9; // 0x638
    USceneComponent* Region8; // 0x640
    USceneComponent* Region7; // 0x648
    USceneComponent* Region6; // 0x650
    USceneComponent* Region5; // 0x658
    USceneComponent* Region4; // 0x660
    USceneComponent* Region3; // 0x668
    USceneComponent* Region2; // 0x670
    USceneComponent* Region1; // 0x678
    USceneComponent* RegionDecals; // 0x680
    UStaticMeshComponent* BeamBMesh; // 0x688
    UStaticMeshComponent* BeamCMesh; // 0x690
    UStaticMeshComponent* BeamDMesh; // 0x698
    UStaticMeshComponent* BeamAMesh; // 0x6a0
    USceneComponent* BeamD; // 0x6a8
    USceneComponent* BeamC; // 0x6b0
    USceneComponent* BeamB; // 0x6b8
    USceneComponent* BeamA; // 0x6c0
    UDecalComponent* Decal; // 0x6c8
    UStaticMeshComponent* Beam4Mesh; // 0x6d0
    USceneComponent* Beam4; // 0x6d8
    UStaticMeshComponent* Beam3Mesh; // 0x6e0
    USceneComponent* Beam3; // 0x6e8
    UStaticMeshComponent* Beam2Mesh; // 0x6f0
    USceneComponent* Beam2; // 0x6f8
    UStaticMeshComponent* Beam1Mesh; // 0x700
    USceneComponent* Beam1; // 0x708
    USceneComponent* Beams; // 0x710
    float PlaceTimeline_DistanceFromSurface_E1E02CDF45363D0D74CF43B8D0F7B6EB; // 0x718
    ETimelineDirection::Type PlaceTimeline__Direction_E1E02CDF45363D0D74CF43B8D0F7B6EB; // 0x71c
    char pad_71d[0x3];
    UTimelineComponent* PlaceTimeline; // 0x720
    float MovementTimeline_HeightOffset_51B15FD044B4AD220542F59FD1F5B2A3; // 0x728
    ETimelineDirection::Type MovementTimeline__Direction_51B15FD044B4AD220542F59FD1F5B2A3; // 0x72c
    char pad_72d[0x3];
    UTimelineComponent* MovementTimeline; // 0x730
    float LiftTimeline_DistanceFromSurface_DD302BA54D96212CC51A4C821CF49AD2; // 0x738
    ETimelineDirection::Type LiftTimeline__Direction_DD302BA54D96212CC51A4C821CF49AD2; // 0x73c
    char pad_73d[0x3];
    UTimelineComponent* LiftTimeline; // 0x740
    char pad_748[0x8];
    FTransform TransformOffset; // 0x750
    float LevitationDistance; // 0x780
    char pad_784[0x4];
    UMaterialInterface* ValidBeamMaterial; // 0x788
    UMaterialInterface* ErrorBeamMaterial; // 0x790
    UMaterialInterface* ValidPlacementMaterial; // 0x798
    UMaterialInterface* ErrorPlacementMaterial; // 0x7a0
    UMaterialInterface* ErrorEdgeMaterial; // 0x7a8
    TArray<bool> BeamLit; // 0x7b0
    float BeamOffsetFromEdge; // 0x7c0
    char pad_7c4[0x4];
    TArray<UDecalComponent*> AllRegionDecals; // 0x7c8
    TArray<UStaticMeshComponent*> AllBeams; // 0x7d8
    TArray<USceneComponent*> AllRegions; // 0x7e8
    ABP_TransfigurationPreviewPlacementAnimator_C* PlacementAnimator; // 0x7f8
    static ABP_TransfigurationMovementStyle_DefaultGround_C* StaticClass();
    void SetWallTransformFromBounds(FVector& LocalExtent, FVector& LocalLocation, int32_t CallFunc_Array_Length_ReturnValue, int32_t CallFunc_Subtract_IntInt_ReturnValue, float CallFunc_BreakRotator_Roll, float CallFunc_BreakRotator_Pitch, float CallFunc_BreakRotator_Yaw, float CallFunc_BreakRotator_Roll_1, float CallFunc_BreakRotator_Pitch_1, float CallFunc_BreakRotator_Yaw_1, FRotator CallFunc_MakeRotator_ReturnValue, FRotator CallFunc_MakeRotator_ReturnValue_1, FHitResult CallFunc_K2_SetRelativeRotation_SweepHitResult, FHitResult CallFunc_K2_SetRelativeRotation_SweepHitResult_1, FVector CallFunc_K2_GetComponentLocation_ReturnValue, FVector CallFunc_K2_GetComponentLocation_ReturnValue_1, float CallFunc_BreakVector_X, float CallFunc_BreakVector_Y, float CallFunc_BreakVector_Z, float CallFunc_BreakVector_X_1, float CallFunc_BreakVector_Y_1, float CallFunc_BreakVector_Z_1, FVector CallFunc_K2_GetComponentLocation_ReturnValue_2, float CallFunc_BreakRotator_Roll_2, float CallFunc_BreakRotator_Pitch_2, float CallFunc_BreakRotator_Yaw_2, FRotator CallFunc_MakeRotator_ReturnValue_2, float CallFunc_BreakVector_X_2, float CallFunc_BreakVector_Y_2, float CallFunc_BreakVector_Z_2, FHitResult CallFunc_K2_SetRelativeRotation_SweepHitResult_2, FVector CallFunc_K2_GetComponentLocation_ReturnValue_3, float CallFunc_BreakRotator_Roll_3, float CallFunc_BreakRotator_Pitch_3, float CallFunc_BreakRotator_Yaw_3, FRotator CallFunc_MakeRotator_ReturnValue_3, float CallFunc_BreakVector_X_3, float CallFunc_BreakVector_Y_3, float CallFunc_BreakVector_Z_3, FHitResult CallFunc_K2_SetRelativeRotation_SweepHitResult_3, APlayerCameraManager* CallFunc_GetPlayerCameraManager_ReturnValue, FVector CallFunc_GetCameraLocation_ReturnValue, FRotator CallFunc_FindLookAtRotation_ReturnValue, float CallFunc_BreakVector_X_4, float CallFunc_BreakVector_Y_4, float CallFunc_BreakVector_Z_4, FHitResult CallFunc_K2_SetWorldRotation_SweepHitResult, float CallFunc_Subtract_FloatFloat_ReturnValue, float CallFunc_Subtract_FloatFloat_ReturnValue_1, FVector CallFunc_MakeVector_ReturnValue, FVector CallFunc_MakeVector_ReturnValue_1, FHitResult CallFunc_K2_SetRelativeLocation_SweepHitResult, FHitResult CallFunc_K2_SetRelativeLocation_SweepHitResult_1, float CallFunc_Multiply_FloatFloat_ReturnValue, float CallFunc_Multiply_FloatFloat_ReturnValue_1, FVector CallFunc_MakeVector_ReturnValue_2, FVector CallFunc_MakeVector_ReturnValue_3, FHitResult CallFunc_K2_SetRelativeLocation_SweepHitResult_2, FHitResult CallFunc_K2_SetRelativeLocation_SweepHitResult_3, FRotator CallFunc_FindLookAtRotation_ReturnValue_1, FRotator CallFunc_FindLookAtRotation_ReturnValue_2, FHitResult CallFunc_K2_SetWorldRotation_SweepHitResult_1, FHitResult CallFunc_K2_SetWorldRotation_SweepHitResult_2, FRotator CallFunc_FindLookAtRotation_ReturnValue_3, FHitResult CallFunc_K2_SetWorldRotation_SweepHitResult_3, float CallFunc_BreakRotator_Roll_4, float CallFunc_BreakRotator_Pitch_4, float CallFunc_BreakRotator_Yaw_4, float CallFunc_BreakRotator_Roll_5, float CallFunc_BreakRotator_Pitch_5, float CallFunc_BreakRotator_Yaw_5, FRotator CallFunc_MakeRotator_ReturnValue_4, FRotator CallFunc_MakeRotator_ReturnValue_5, FHitResult CallFunc_K2_SetRelativeRotation_SweepHitResult_4, FHitResult CallFunc_K2_SetRelativeRotation_SweepHitResult_5, FVector CallFunc_K2_GetComponentLocation_ReturnValue_4, FVector CallFunc_K2_GetComponentLocation_ReturnValue_5, float CallFunc_BreakVector_X_5, float CallFunc_BreakVector_Y_5, float CallFunc_BreakVector_Z_5, float CallFunc_BreakVector_X_6, float CallFunc_BreakVector_Y_6, float CallFunc_BreakVector_Z_6, FVector CallFunc_K2_GetComponentLocation_ReturnValue_6, float CallFunc_BreakRotator_Roll_6, float CallFunc_BreakRotator_Pitch_6, float CallFunc_BreakRotator_Yaw_6, FRotator CallFunc_MakeRotator_ReturnValue_6, float CallFunc_BreakVector_X_7, float CallFunc_BreakVector_Y_7, float CallFunc_BreakVector_Z_7, FHitResult CallFunc_K2_SetRelativeRotation_SweepHitResult_6, APlayerCameraManager* CallFunc_GetPlayerCameraManager_ReturnValue_1, FVector CallFunc_GetCameraLocation_ReturnValue_1, float CallFunc_BreakRotator_Roll_7, float CallFunc_BreakRotator_Pitch_7, float CallFunc_BreakRotator_Yaw_7, FRotator CallFunc_FindLookAtRotation_ReturnValue_4, FRotator CallFunc_MakeRotator_ReturnValue_7, FHitResult CallFunc_K2_SetWorldRotation_SweepHitResult_4, FHitResult CallFunc_K2_SetRelativeRotation_SweepHitResult_7, FRotator CallFunc_FindLookAtRotation_ReturnValue_5, FRotator CallFunc_FindLookAtRotation_ReturnValue_6, FHitResult CallFunc_K2_SetWorldRotation_SweepHitResult_5, FHitResult CallFunc_K2_SetWorldRotation_SweepHitResult_6, FVector CallFunc_K2_GetComponentLocation_ReturnValue_7, FRotator CallFunc_FindLookAtRotation_ReturnValue_7, float CallFunc_BreakVector_X_8, float CallFunc_BreakVector_Y_8, float CallFunc_BreakVector_Z_8, FHitResult CallFunc_K2_SetWorldRotation_SweepHitResult_7, int32_t Temp_int_Variable, USceneComponent* CallFunc_Array_Get_Item, float CallFunc_BreakVector_X_9, float CallFunc_BreakVector_Y_9, float CallFunc_BreakVector_Z_9, float CallFunc_Subtract_FloatFloat_ReturnValue_2, FVector CallFunc_GreaterGreater_VectorRotator_ReturnValue, float CallFunc_Multiply_FloatFloat_ReturnValue_2, FVector CallFunc_GreaterGreater_VectorRotator_ReturnValue_1, float CallFunc_Subtract_FloatFloat_ReturnValue_3, FVector K2Node_MathExpression_ReturnValue, FVector CallFunc_MakeVector_ReturnValue_4, float CallFunc_BreakVector_X_10, float CallFunc_BreakVector_Y_10, float CallFunc_BreakVector_Z_10, FHitResult CallFunc_K2_SetRelativeLocation_SweepHitResult_4, FVector CallFunc_MakeVector_ReturnValue_5, FVector CallFunc_MakeVector_ReturnValue_6, FHitResult CallFunc_K2_SetRelativeLocation_SweepHitResult_5, FHitResult CallFunc_K2_SetRelativeLocation_SweepHitResult_6, float CallFunc_Multiply_FloatFloat_ReturnValue_3, FVector K2Node_MathExpression_ReturnValue_1, FVector CallFunc_MakeVector_ReturnValue_7, float CallFunc_BreakVector_X_11, float CallFunc_BreakVector_Y_11, float CallFunc_BreakVector_Z_11, FHitResult CallFunc_K2_SetRelativeLocation_SweepHitResult_7, FVector CallFunc_MakeVector_ReturnValue_8, FVector CallFunc_MakeVector_ReturnValue_9, FHitResult CallFunc_K2_SetRelativeLocation_SweepHitResult_8, bool CallFunc_LessEqual_IntInt_ReturnValue, int32_t CallFunc_Add_IntInt_ReturnValue, FVector CallFunc_Vector_Up_ReturnValue, FTransform CallFunc_GetTargetTransform_ReturnValue, FRotator CallFunc_MakeRotFromYZ_ReturnValue, FVector CallFunc_BreakTransform_Location, FRotator CallFunc_BreakTransform_Rotation, FVector CallFunc_BreakTransform_Scale, FVector CallFunc_TransformLocation_ReturnValue, FVector CallFunc_Multiply_VectorVector_ReturnValue, FTransform CallFunc_MakeTransform_ReturnValue, float CallFunc_BreakVector_X_12, float CallFunc_BreakVector_Y_12, float CallFunc_BreakVector_Z_12, FHitResult CallFunc_K2_SetWorldTransform_SweepHitResult, float CallFunc_Abs_ReturnValue, float CallFunc_Abs_ReturnValue_1, FVector CallFunc_MakeVector_ReturnValue_10);
    void SetTransformFromBounds(FVector& LocalExtent, FVector& LocalLocation, int32_t CallFunc_Array_Length_ReturnValue, int32_t CallFunc_Subtract_IntInt_ReturnValue, FVector CallFunc_K2_GetComponentLocation_ReturnValue, FVector CallFunc_K2_GetComponentLocation_ReturnValue_1, float CallFunc_BreakVector_X, float CallFunc_BreakVector_Y, float CallFunc_BreakVector_Z, float CallFunc_BreakVector_X_1, float CallFunc_BreakVector_Y_1, float CallFunc_BreakVector_Z_1, FVector CallFunc_K2_GetComponentLocation_ReturnValue_2, FVector CallFunc_K2_GetComponentLocation_ReturnValue_3, float CallFunc_BreakVector_X_2, float CallFunc_BreakVector_Y_2, float CallFunc_BreakVector_Z_2, float CallFunc_BreakVector_X_3, float CallFunc_BreakVector_Y_3, float CallFunc_BreakVector_Z_3, APlayerCameraManager* CallFunc_GetPlayerCameraManager_ReturnValue, FVector CallFunc_GetCameraLocation_ReturnValue, FRotator CallFunc_FindLookAtRotation_ReturnValue, float CallFunc_BreakVector_X_4, float CallFunc_BreakVector_Y_4, float CallFunc_BreakVector_Z_4, float CallFunc_BreakRotator_Roll, float CallFunc_BreakRotator_Pitch, float CallFunc_BreakRotator_Yaw, float CallFunc_Subtract_FloatFloat_ReturnValue, FRotator CallFunc_MakeRotator_ReturnValue, FVector CallFunc_MakeVector_ReturnValue, FHitResult CallFunc_K2_SetWorldRotation_SweepHitResult, FHitResult CallFunc_K2_SetRelativeLocation_SweepHitResult, float CallFunc_Multiply_FloatFloat_ReturnValue, float CallFunc_Subtract_FloatFloat_ReturnValue_1, FVector CallFunc_MakeVector_ReturnValue_1, FVector CallFunc_MakeVector_ReturnValue_2, FHitResult CallFunc_K2_SetRelativeLocation_SweepHitResult_1, FHitResult CallFunc_K2_SetRelativeLocation_SweepHitResult_2, float CallFunc_Multiply_FloatFloat_ReturnValue_1, FRotator CallFunc_FindLookAtRotation_ReturnValue_1, FVector CallFunc_MakeVector_ReturnValue_3, float CallFunc_BreakRotator_Roll_1, float CallFunc_BreakRotator_Pitch_1, float CallFunc_BreakRotator_Yaw_1, FHitResult CallFunc_K2_SetRelativeLocation_SweepHitResult_3, FRotator CallFunc_MakeRotator_ReturnValue_1, FRotator CallFunc_FindLookAtRotation_ReturnValue_2, FHitResult CallFunc_K2_SetWorldRotation_SweepHitResult_1, float CallFunc_BreakRotator_Roll_2, float CallFunc_BreakRotator_Pitch_2, float CallFunc_BreakRotator_Yaw_2, FRotator CallFunc_FindLookAtRotation_ReturnValue_3, FRotator CallFunc_MakeRotator_ReturnValue_2, float CallFunc_BreakRotator_Roll_3, float CallFunc_BreakRotator_Pitch_3, float CallFunc_BreakRotator_Yaw_3, FHitResult CallFunc_K2_SetWorldRotation_SweepHitResult_2, FRotator CallFunc_MakeRotator_ReturnValue_3, FHitResult CallFunc_K2_SetWorldRotation_SweepHitResult_3, FVector CallFunc_K2_GetComponentLocation_ReturnValue_4, FVector CallFunc_K2_GetComponentLocation_ReturnValue_5, float CallFunc_BreakVector_X_5, float CallFunc_BreakVector_Y_5, float CallFunc_BreakVector_Z_5, float CallFunc_BreakVector_X_6, float CallFunc_BreakVector_Y_6, float CallFunc_BreakVector_Z_6, FVector CallFunc_K2_GetComponentLocation_ReturnValue_6, FVector CallFunc_K2_GetComponentLocation_ReturnValue_7, float CallFunc_BreakVector_X_7, float CallFunc_BreakVector_Y_7, float CallFunc_BreakVector_Z_7, float CallFunc_BreakVector_X_8, float CallFunc_BreakVector_Y_8, float CallFunc_BreakVector_Z_8, APlayerCameraManager* CallFunc_GetPlayerCameraManager_ReturnValue_1, int32_t Temp_int_Variable, FVector CallFunc_GetCameraLocation_ReturnValue_1, USceneComponent* CallFunc_Array_Get_Item, FRotator CallFunc_FindLookAtRotation_ReturnValue_4, FRotator CallFunc_FindLookAtRotation_ReturnValue_5, float CallFunc_BreakRotator_Roll_4, float CallFunc_BreakRotator_Pitch_4, float CallFunc_BreakRotator_Yaw_4, float CallFunc_BreakRotator_Roll_5, float CallFunc_BreakRotator_Pitch_5, float CallFunc_BreakRotator_Yaw_5, FRotator CallFunc_MakeRotator_ReturnValue_4, FRotator CallFunc_MakeRotator_ReturnValue_5, FHitResult CallFunc_K2_SetWorldRotation_SweepHitResult_4, FHitResult CallFunc_K2_SetWorldRotation_SweepHitResult_5, FRotator CallFunc_FindLookAtRotation_ReturnValue_6, FRotator CallFunc_FindLookAtRotation_ReturnValue_7, float CallFunc_BreakRotator_Roll_6, float CallFunc_BreakRotator_Pitch_6, float CallFunc_BreakRotator_Yaw_6, float CallFunc_BreakRotator_Roll_7, float CallFunc_BreakRotator_Pitch_7, float CallFunc_BreakRotator_Yaw_7, FRotator CallFunc_MakeRotator_ReturnValue_6, FRotator CallFunc_MakeRotator_ReturnValue_7, FHitResult CallFunc_K2_SetWorldRotation_SweepHitResult_6, FHitResult CallFunc_K2_SetWorldRotation_SweepHitResult_7, bool CallFunc_LessEqual_IntInt_ReturnValue, FVector CallFunc_GreaterGreater_VectorRotator_ReturnValue, FVector CallFunc_GreaterGreater_VectorRotator_ReturnValue_1, int32_t CallFunc_Add_IntInt_ReturnValue, FVector K2Node_MathExpression_ReturnValue, float CallFunc_BreakVector_X_9, float CallFunc_BreakVector_Y_9, float CallFunc_BreakVector_Z_9, FVector K2Node_MathExpression_ReturnValue_1, FVector CallFunc_MakeVector_ReturnValue_4, float CallFunc_BreakVector_X_10, float CallFunc_BreakVector_Y_10, float CallFunc_BreakVector_Z_10, FHitResult CallFunc_K2_SetRelativeLocation_SweepHitResult_4, FVector CallFunc_MakeVector_ReturnValue_5, float CallFunc_BreakVector_X_11, float CallFunc_BreakVector_Y_11, float CallFunc_BreakVector_Z_11, float CallFunc_Subtract_FloatFloat_ReturnValue_2, FTransform CallFunc_GetTargetTransform_ReturnValue, float CallFunc_Multiply_FloatFloat_ReturnValue_2, FVector CallFunc_BreakTransform_Location, FRotator CallFunc_BreakTransform_Rotation, FVector CallFunc_BreakTransform_Scale, FVector CallFunc_TransformLocation_ReturnValue, FVector CallFunc_Multiply_VectorVector_ReturnValue, FVector CallFunc_GetRightVector_ReturnValue, float CallFunc_BreakVector_X_12, float CallFunc_BreakVector_Y_12, float CallFunc_BreakVector_Z_12, float CallFunc_Abs_ReturnValue, FRotator CallFunc_MakeRotFromZY_ReturnValue, float CallFunc_Abs_ReturnValue_1, FTransform CallFunc_MakeTransform_ReturnValue, FVector CallFunc_MakeVector_ReturnValue_6, FHitResult CallFunc_K2_SetWorldTransform_SweepHitResult, float CallFunc_Subtract_FloatFloat_ReturnValue_3, float CallFunc_Multiply_FloatFloat_ReturnValue_3, FVector CallFunc_MakeVector_ReturnValue_7, FVector CallFunc_MakeVector_ReturnValue_8, FHitResult CallFunc_K2_SetRelativeLocation_SweepHitResult_5, FHitResult CallFunc_K2_SetRelativeLocation_SweepHitResult_6, FVector CallFunc_MakeVector_ReturnValue_9, FVector CallFunc_MakeVector_ReturnValue_10, FHitResult CallFunc_K2_SetRelativeLocation_SweepHitResult_7, FHitResult CallFunc_K2_SetRelativeLocation_SweepHitResult_8);
    void Update_Decals_Visibility(bool CanPlace, E_PreviewActorState::Type PreviewActorState, bool CallFunc_EqualEqual_ByteByte_ReturnValue, bool CallFunc_EqualEqual_ByteByte_ReturnValue_1, bool CallFunc_BooleanOR_ReturnValue, bool CallFunc_EqualEqual_ByteByte_ReturnValue_2, bool CallFunc_EqualEqual_ByteByte_ReturnValue_3, bool CallFunc_BooleanOR_ReturnValue_1, bool CallFunc_IsValid_ReturnValue, ABP_TransfigurationPreviewActor_C* K2Node_DynamicCast_AsBP_Transfiguration_Preview_Actor, bool K2Node_DynamicCast_bSuccess, UMaterialInterface* CallFunc_GetDecalMaterial_ReturnValue, UMaterialInterface* CallFunc_GetDecalMaterial_ReturnValue_1, bool CallFunc_NotEqual_ObjectObject_ReturnValue, bool CallFunc_NotEqual_ObjectObject_ReturnValue_1, bool CallFunc_EqualEqual_BoolBool_ReturnValue);
    void SetBeamBlockedState(UPrimitiveComponent* BeamComponent, bool IsBlocked);
    void UpdateBeamStates(bool TopRightBlocked, bool TopCentreBlocked, bool TopLeftBlocked, bool CentreRightBlocked, bool CentreBlocked, bool CentreLeftBlocked, bool BottomRightBlocked, bool BottomCentreBlocked, bool BottomLeftBlocked, int32_t CallFunc_Array_Length_ReturnValue, int32_t CallFunc_Subtract_IntInt_ReturnValue, int32_t Temp_int_Variable, UDecalComponent* CallFunc_Array_Get_Item, int32_t CallFunc_Array_Length_ReturnValue_1, bool CallFunc_IsVisible_ReturnValue, int32_t CallFunc_Subtract_IntInt_ReturnValue_1, bool CallFunc_NotEqual_BoolBool_ReturnValue, bool CallFunc_LessEqual_IntInt_ReturnValue, int32_t CallFunc_Add_IntInt_ReturnValue, int32_t Temp_int_Variable_1, UStaticMeshComponent* CallFunc_Array_Get_Item_1, bool CallFunc_IsVisible_ReturnValue_1, bool CallFunc_NotEqual_BoolBool_ReturnValue_1, bool CallFunc_LessEqual_IntInt_ReturnValue_1, int32_t CallFunc_Add_IntInt_ReturnValue_1);
    void LiftTimeline__FinishedFunc();
    void LiftTimeline__UpdateFunc();
    void MovementTimeline__FinishedFunc();
    void MovementTimeline__UpdateFunc();
    void PlaceTimeline__FinishedFunc();
    void PlaceTimeline__UpdateFunc();
    void PlaceTimeline__Impact__EventFunc();
    void Lift();
    void Place();
    void ReceiveTick(float DeltaSeconds);
    void CanPlace(bool bCanPlace);
    void ShowDecal(bool bShow);
    void ClearLitBeams();
    void ReceiveBeginPlay();
    void ShowBeamAtLocalLocation(FVector& InLocationLocal);
    void ExecuteUbergraph_BP_TransfigurationMovementStyle_DefaultGround(int32_t EntryPoint, FTransform CallFunc_MakeTransform_ReturnValue, FTransform CallFunc_MakeTransform_ReturnValue_1, bool Temp_bool_Variable, FTransform CallFunc_MakeTransform_ReturnValue_2, bool Temp_bool_Variable_1, int32_t Temp_int_Array_Index_Variable, int32_t Temp_int_Loop_Counter_Variable, int32_t CallFunc_Add_IntInt_ReturnValue, bool Temp_bool_True_if_break_was_hit_Variable, int32_t Temp_int_Array_Index_Variable_1, bool CallFunc_Not_PreBool_ReturnValue, FVector CallFunc_InverseTransformDirection_ReturnValue, FVector CallFunc_InverseTransformDirection_ReturnValue_1, float CallFunc_Multiply_FloatFloat_ReturnValue, FVector CallFunc_Multiply_VectorFloat_ReturnValue, float CallFunc_Multiply_FloatFloat_ReturnValue_1, FTransform CallFunc_MakeTransform_ReturnValue_3, FVector CallFunc_Multiply_VectorFloat_ReturnValue_1, FTransform CallFunc_MakeTransform_ReturnValue_4, float CallFunc_Multiply_FloatFloat_ReturnValue_2, FVector CallFunc_BreakTransform_Location, FRotator CallFunc_BreakTransform_Rotation, FVector CallFunc_BreakTransform_Scale, float CallFunc_Add_FloatFloat_ReturnValue, FVector CallFunc_GetPreviewBounds_OutCenter, FVector CallFunc_GetPreviewBounds_OutExtent, float CallFunc_GetMaxElement_ReturnValue, float CallFunc_Multiply_FloatFloat_ReturnValue_3, FVector CallFunc_InverseTransformDirection_ReturnValue_2, float CallFunc_Add_FloatFloat_ReturnValue_1, FVector CallFunc_Multiply_VectorFloat_ReturnValue_2, float CallFunc_Multiply_FloatFloat_ReturnValue_4, FTransform CallFunc_MakeTransform_ReturnValue_5, float CallFunc_Add_FloatFloat_ReturnValue_2, float K2Node_Event_DeltaSeconds, FVector CallFunc_InverseTransformDirection_ReturnValue_3, bool K2Node_Event_bCanPlace, FVector CallFunc_Multiply_VectorFloat_ReturnValue_3, FTransform CallFunc_MakeTransform_ReturnValue_6, bool K2Node_Event_bShow, bool CallFunc_IsBeingRemoved_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue_1, bool CallFunc_IsVisible_ReturnValue, bool CallFunc_IsVisible_ReturnValue_1, bool CallFunc_NotEqual_BoolBool_ReturnValue, bool CallFunc_NotEqual_BoolBool_ReturnValue_1, int32_t CallFunc_Array_Length_ReturnValue, TArray<UDecalComponent*>& K2Node_MakeArray_Array, TArray<UStaticMeshComponent*>& K2Node_MakeArray_Array_1, TArray<USceneComponent*>& K2Node_MakeArray_Array_2, bool CallFunc_IsPrefab_ReturnValue, bool CallFunc_UsesSurfacePlacement_ReturnValue, bool CallFunc_BooleanOR_ReturnValue, AActor* CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue, bool CallFunc_IsValid_ReturnValue, ABP_TransfigurationPreviewPlacementAnimator_C* CallFunc_FinishSpawningActor_ReturnValue, int32_t Temp_int_Loop_Counter_Variable_1, bool CallFunc_Less_IntInt_ReturnValue, int32_t CallFunc_Add_IntInt_ReturnValue_1, bool CallFunc_UsesSurfacePlacement_ReturnValue_1, FRotator CallFunc_K2_GetComponentRotation_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue_2, FVector CallFunc_GetUpVector_ReturnValue, bool CallFunc_EqualEqual_VectorVector_ReturnValue, bool CallFunc_BooleanAND_ReturnValue, FVector CallFunc_BreakTransform_Location_1, FRotator CallFunc_BreakTransform_Rotation_1, FVector CallFunc_BreakTransform_Scale_1, float CallFunc_BreakVector_X, float CallFunc_BreakVector_Y, float CallFunc_BreakVector_Z, UAnimInstance* CallFunc_GetAnimInstance_ReturnValue, FVector CallFunc_MakeVector_ReturnValue, UABP_TransfigurationPlaceDown_C* K2Node_DynamicCast_AsABP_Transfiguration_Place_Down, bool K2Node_DynamicCast_bSuccess, FVector CallFunc_K2_GetActorLocation_ReturnValue, float CallFunc_BreakVector_X_1, float CallFunc_BreakVector_Y_1, float CallFunc_BreakVector_Z_1, FVector CallFunc_MakeVector_ReturnValue_1, FVector K2Node_Event_InLocationLocal, bool CallFunc_EqualEqual_VectorVector_ReturnValue_1, bool CallFunc_BooleanAND_ReturnValue_1, TArray<USceneComponent*>& K2Node_MakeArray_Array_3, USceneComponent* CallFunc_Array_Get_Item, int32_t CallFunc_Array_Length_ReturnValue_1, bool CallFunc_Less_IntInt_ReturnValue_1, float CallFunc_Vector_DistanceSquared_ReturnValue, bool CallFunc_BooleanAND_ReturnValue_2, bool CallFunc_Less_FloatFloat_ReturnValue);
}; // Size: 0x800
#pragma pack(pop)
