#pragma once
#include <cstdint>
#include "AActor.hpp"
class UStaticMeshComponent;
class USceneComponent;
#pragma pack(push, 1)
class ABP_Small_CastleRuins_1_F1_C : public AActor {
public:
    UStaticMeshComponent* StaticMeshComponent8; // 0x248
    UStaticMeshComponent* StaticMeshComponent14; // 0x250
    UStaticMeshComponent* StaticMeshComponent13; // 0x258
    UStaticMeshComponent* StaticMeshComponent7; // 0x260
    UStaticMeshComponent* StaticMeshComponent6; // 0x268
    UStaticMeshComponent* StaticMeshComponent5; // 0x270
    UStaticMeshComponent* StaticMeshComponent4; // 0x278
    UStaticMeshComponent* StaticMeshComponent3; // 0x280
    UStaticMeshComponent* StaticMeshComponent1; // 0x288
    UStaticMeshComponent* StaticMeshComponent0; // 0x290
    USceneComponent* SharedRoot; // 0x298
    static ABP_Small_CastleRuins_1_F1_C* StaticClass();
}; // Size: 0x2a0
#pragma pack(pop)
