#pragma once
#include <cstdint>
#include "AActor.hpp"
class UAnimatedLightComponent;
class UPointLightComponent;
class UStaticMeshComponent;
class UMaterialBillboardComponent;
class USceneComponent;
#pragma pack(push, 1)
class ABP_Sanc_HubCornerBookshelfs_03_Dwiz_Dressing03_C : public AActor {
public:
    UAnimatedLightComponent* AnimatedLight4; // 0x248
    UPointLightComponent* PointLight2; // 0x250
    UStaticMeshComponent* SM_HW_L_New_Book_A10; // 0x258
    UStaticMeshComponent* SM_HW_L_New_Book_A4; // 0x260
    UStaticMeshComponent* SM_Sanc_Jar_Dwiz_01A6; // 0x268
    UStaticMeshComponent* SM_HW_DAO_SkullHorns05; // 0x270
    UStaticMeshComponent* StaticMeshComponent016; // 0x278
    UStaticMeshComponent* StaticMeshComponent03; // 0x280
    UMaterialBillboardComponent* MaterialBillboard16; // 0x288
    UStaticMeshComponent* StaticMeshComponent05; // 0x290
    UStaticMeshComponent* StaticMeshComponent04; // 0x298
    UStaticMeshComponent* StaticMeshComponent013; // 0x2a0
    UStaticMeshComponent* SM_HW_L_New_Book_A12; // 0x2a8
    UMaterialBillboardComponent* MaterialBillboard14; // 0x2b0
    UStaticMeshComponent* StaticMeshComponent014; // 0x2b8
    UStaticMeshComponent* StaticMeshComponent029; // 0x2c0
    UStaticMeshComponent* SM_HW_HourGlass_D1; // 0x2c8
    UStaticMeshComponent* SM_Sanc_Jar_Dwiz_01A3; // 0x2d0
    UStaticMeshComponent* SM_HM_3Broom_Jug_C1; // 0x2d8
    UStaticMeshComponent* SM_HW_L_New_Book_A1; // 0x2e0
    UMaterialBillboardComponent* MaterialBillboard13; // 0x2e8
    UStaticMeshComponent* SM_Sanc_Curtains_02_Dwiz2; // 0x2f0
    UMaterialBillboardComponent* MaterialBillboard15; // 0x2f8
    USceneComponent* SceneRoot; // 0x300
    static ABP_Sanc_HubCornerBookshelfs_03_Dwiz_Dressing03_C* StaticClass();
}; // Size: 0x308
#pragma pack(pop)
