#pragma once
#include <cstdint>
#include "AActor.hpp"
class UPhysicalResponseComponent;
class UStaticMeshComponent;
class USceneComponent;
#pragma pack(push, 1)
class ABP_Sanc_TerrariumForestStart_Dwiz_Dressing02_C : public AActor {
public:
    UPhysicalResponseComponent* PhysicalResponse78; // 0x248
    UPhysicalResponseComponent* PhysicalResponse77; // 0x250
    UPhysicalResponseComponent* PhysicalResponse76; // 0x258
    UPhysicalResponseComponent* PhysicalResponse71; // 0x260
    UPhysicalResponseComponent* PhysicalResponse8; // 0x268
    UPhysicalResponseComponent* PhysicalResponse7; // 0x270
    UPhysicalResponseComponent* PhysicalResponse72; // 0x278
    UStaticMeshComponent* SM_HW_L_New_Book_A8; // 0x280
    UStaticMeshComponent* SM_HW_L_New_Book_A2; // 0x288
    UStaticMeshComponent* SM_Sanc_L_BookRow_Half_D2; // 0x290
    UStaticMeshComponent* SM_HM_Quill_Rolled_Parchment_Pile_A5; // 0x298
    UStaticMeshComponent* StaticMeshComponent044; // 0x2a0
    UPhysicalResponseComponent* PhysicalResponse70; // 0x2a8
    UStaticMeshComponent* StaticMeshComponent054; // 0x2b0
    UStaticMeshComponent* SM_HW_L_New_Book_F2; // 0x2b8
    UStaticMeshComponent* StaticMeshComponent053; // 0x2c0
    UStaticMeshComponent* StaticMeshComponent051; // 0x2c8
    UStaticMeshComponent* SM_HW_HourGlass_D2; // 0x2d0
    USceneComponent* SceneRoot; // 0x2d8
    static ABP_Sanc_TerrariumForestStart_Dwiz_Dressing02_C* StaticClass();
}; // Size: 0x2e0
#pragma pack(pop)
