#pragma once
#include <cstdint>
#include "AActor.hpp"
class UChildActorComponent;
class UStaticMeshComponent;
class UPhysicalResponseComponent;
class USceneComponent;
#pragma pack(push, 1)
class ABP_Poachers_BarBarrels_A_C : public AActor {
public:
    UChildActorComponent* BP_Cav_DestructibleJug_03; // 0x248
    UChildActorComponent* BP_Cav_DestructibleJug_02; // 0x250
    UStaticMeshComponent* StaticMeshComponent1; // 0x258
    UStaticMeshComponent* StaticMeshComponent2; // 0x260
    UStaticMeshComponent* StaticMeshComponent26; // 0x268
    UStaticMeshComponent* StaticMeshComponent23; // 0x270
    UStaticMeshComponent* StaticMeshComponent20; // 0x278
    UStaticMeshComponent* StaticMeshComponent16; // 0x280
    UStaticMeshComponent* StaticMeshComponent8; // 0x288
    UStaticMeshComponent* StaticMeshComponent7; // 0x290
    UPhysicalResponseComponent* PhysicalResponse24; // 0x298
    UPhysicalResponseComponent* PhysicalResponse23; // 0x2a0
    UPhysicalResponseComponent* PhysicalResponse20; // 0x2a8
    UPhysicalResponseComponent* PhysicalResponse15; // 0x2b0
    UPhysicalResponseComponent* PhysicalResponse14; // 0x2b8
    UPhysicalResponseComponent* PhysicalResponse13; // 0x2c0
    UPhysicalResponseComponent* PhysicalResponse12; // 0x2c8
    UStaticMeshComponent* StaticMeshComponent50; // 0x2d0
    UStaticMeshComponent* StaticMeshComponent49; // 0x2d8
    UStaticMeshComponent* StaticMeshComponent48; // 0x2e0
    UStaticMeshComponent* StaticMeshComponent47; // 0x2e8
    UStaticMeshComponent* StaticMeshComponent46; // 0x2f0
    UStaticMeshComponent* StaticMeshComponent45; // 0x2f8
    UStaticMeshComponent* StaticMeshComponent44; // 0x300
    UStaticMeshComponent* StaticMeshComponent43; // 0x308
    UStaticMeshComponent* StaticMeshComponent42; // 0x310
    UStaticMeshComponent* StaticMeshComponent41; // 0x318
    UStaticMeshComponent* StaticMeshComponent40; // 0x320
    UStaticMeshComponent* StaticMeshComponent39; // 0x328
    UStaticMeshComponent* StaticMeshComponent38; // 0x330
    UStaticMeshComponent* StaticMeshComponent37; // 0x338
    UStaticMeshComponent* StaticMeshComponent36; // 0x340
    UStaticMeshComponent* StaticMeshComponent35; // 0x348
    UStaticMeshComponent* StaticMeshComponent34; // 0x350
    UStaticMeshComponent* StaticMeshComponent33; // 0x358
    UStaticMeshComponent* StaticMeshComponent25; // 0x360
    UStaticMeshComponent* StaticMeshComponent24; // 0x368
    UStaticMeshComponent* StaticMeshComponent21; // 0x370
    UStaticMeshComponent* StaticMeshComponent19; // 0x378
    UStaticMeshComponent* StaticMeshComponent18; // 0x380
    UStaticMeshComponent* StaticMeshComponent17; // 0x388
    UStaticMeshComponent* StaticMeshComponent15; // 0x390
    UStaticMeshComponent* StaticMeshComponent14; // 0x398
    UStaticMeshComponent* StaticMeshComponent13; // 0x3a0
    UStaticMeshComponent* StaticMeshComponent12; // 0x3a8
    UStaticMeshComponent* StaticMeshComponent11; // 0x3b0
    UStaticMeshComponent* StaticMeshComponent10; // 0x3b8
    UStaticMeshComponent* StaticMeshComponent9; // 0x3c0
    UStaticMeshComponent* StaticMeshComponent6; // 0x3c8
    UStaticMeshComponent* StaticMeshComponent5; // 0x3d0
    UStaticMeshComponent* StaticMeshComponent3; // 0x3d8
    UStaticMeshComponent* StaticMeshComponent0; // 0x3e0
    UStaticMeshComponent* StaticMeshComponent51; // 0x3e8
    USceneComponent* SharedRoot; // 0x3f0
    static ABP_Poachers_BarBarrels_A_C* StaticClass();
}; // Size: 0x3f8
#pragma pack(pop)
