#pragma once
#include <cstdint>
#include "AActor.hpp"
class UStaticMeshComponent;
class USceneComponent;
#pragma pack(push, 1)
class ABP_Sanc_HubCornerBookshelfs_03_Dwiz_Dressing04_C : public AActor {
public:
    UStaticMeshComponent* SM_HW_L_New_Book_A; // 0x248
    UStaticMeshComponent* StaticMesh18; // 0x250
    UStaticMeshComponent* StaticMesh45; // 0x258
    UStaticMeshComponent* StaticMesh55; // 0x260
    UStaticMeshComponent* SM_HW_L_New_Book_A11; // 0x268
    UStaticMeshComponent* SM_HW_DAO_SheepVase_A; // 0x270
    UStaticMeshComponent* SM_HW_L_New_Book_A9; // 0x278
    UStaticMeshComponent* StaticMeshComponent053; // 0x280
    UStaticMeshComponent* StaticMeshComponent043; // 0x288
    UStaticMeshComponent* SM_HW_DAO_DriedMerman; // 0x290
    UStaticMeshComponent* StaticMesh16; // 0x298
    UStaticMeshComponent* SM_Sanc_Curtains_02_Dwiz3; // 0x2a0
    UStaticMeshComponent* StaticMeshComponent052; // 0x2a8
    USceneComponent* SceneRoot; // 0x2b0
    static ABP_Sanc_HubCornerBookshelfs_03_Dwiz_Dressing04_C* StaticClass();
}; // Size: 0x2b8
#pragma pack(pop)
