#pragma once
#include <cstdint>
#include "AActor.hpp"
class UStaticMeshComponent;
class UMaterialBillboardComponent;
class USceneComponent;
#pragma pack(push, 1)
class ABP_Sanc_HubCornerBookshelfs_03_Dwiz_Dressing01_C : public AActor {
public:
    UStaticMeshComponent* SM_HW_L_New_Book_A8; // 0x248
    UStaticMeshComponent* SM_HW_L_New_Book_A7; // 0x250
    UStaticMeshComponent* SM_HW_L_New_Book_A6; // 0x258
    UStaticMeshComponent* StaticMeshComponent036; // 0x260
    UStaticMeshComponent* SM_Sanc_Jar_Dwiz_01A2; // 0x268
    UStaticMeshComponent* StaticMeshComponent042; // 0x270
    UStaticMeshComponent* StaticMeshComponent046; // 0x278
    UStaticMeshComponent* StaticMeshComponent032; // 0x280
    UStaticMeshComponent* StaticMeshComponent030; // 0x288
    UStaticMeshComponent* StaticMeshComponent026; // 0x290
    UStaticMeshComponent* StaticMeshComponent045; // 0x298
    UStaticMeshComponent* StaticMeshComponent031; // 0x2a0
    UStaticMeshComponent* StaticMeshComponent050; // 0x2a8
    UStaticMeshComponent* StaticMeshComponent048; // 0x2b0
    UStaticMeshComponent* StaticMeshComponent024; // 0x2b8
    UStaticMeshComponent* SM_Sanc_Jar_Dwiz_01A4; // 0x2c0
    UStaticMeshComponent* SM_HW_L_New_Book_A3; // 0x2c8
    UMaterialBillboardComponent* MaterialBillboard11; // 0x2d0
    UStaticMeshComponent* SM_Sanc_Candle_Dwiz_01A1; // 0x2d8
    UStaticMeshComponent* SM_HW_HourGlass_D; // 0x2e0
    UStaticMeshComponent* StaticMeshComponent044; // 0x2e8
    UStaticMeshComponent* StaticMeshComponent051; // 0x2f0
    UStaticMeshComponent* SM_Sanc_Curtains_02_Dwiz5; // 0x2f8
    UStaticMeshComponent* SM_Sanc_ColumnSmall_01_Dwiz4; // 0x300
    UStaticMeshComponent* SM_Sanc_ColumnSmall_01_Dwiz3; // 0x308
    UStaticMeshComponent* StaticMeshComponent023; // 0x310
    USceneComponent* SceneRoot; // 0x318
    static ABP_Sanc_HubCornerBookshelfs_03_Dwiz_Dressing01_C* StaticClass();
}; // Size: 0x320
#pragma pack(pop)
