#pragma once
#include <cstdint>
#include "ABP_Sanc_TerrariumForestStart_Parent_C.hpp"
#include "FAkExternalSourceInfo.hpp"
#include "FPointerToUberGraphFrame.hpp"
#include "FVector.hpp"
class UDeferredChildActorComponent;
class UStaticMeshComponent;
class UChildActorComponent;
class UAkAudioEvent;
class UAkComponent;
#pragma pack(push, 1)
class ABP_Sanc_TerrariumForestStart_Dwiz_C : public ABP_Sanc_TerrariumForestStart_Parent_C {
public:
    FPointerToUberGraphFrame UberGraphFrame; // 0x4f8
    UDeferredChildActorComponent* Deferred_Dressing04; // 0x500
    UDeferredChildActorComponent* Deferred_Dressing03; // 0x508
    UDeferredChildActorComponent* Deferred_Dressing02; // 0x510
    UDeferredChildActorComponent* Deferred_Dressing01; // 0x518
    UStaticMeshComponent* SM_Sanc_Jar_Dwiz_01A12; // 0x520
    UStaticMeshComponent* SM_Sanc_Jar_Dwiz_01A9; // 0x528
    UStaticMeshComponent* SM_Sanc_Jar_Dwiz_01A7; // 0x530
    UStaticMeshComponent* SM_Sanc_Jar_Dwiz_01A6; // 0x538
    UStaticMeshComponent* SM_Sanc_Jar_Dwiz_01A11; // 0x540
    UStaticMeshComponent* SM_Sanc_Jar_Dwiz_01A8; // 0x548
    UStaticMeshComponent* SM_Sanc_Jar_Dwiz_01A5; // 0x550
    UStaticMeshComponent* SM_Sanc_Jar_Dwiz_01A4; // 0x558
    UChildActorComponent* BP_Sanc_LightFixtureOmniDirectional_01_Dwiz1; // 0x560
    UChildActorComponent* BP_Sanc_LightFixtureOmniDirectional_01_Dwiz; // 0x568
    UStaticMeshComponent* SM_Sanc_TerrariumForestStart_08; // 0x570
    UStaticMeshComponent* SM_Sanc_TerrariumForestStart_07_Dwiz; // 0x578
    UStaticMeshComponent* SM_Sanc_TerrariumForestClockHand_03_0; // 0x580
    UStaticMeshComponent* SM_Sanc_TerrariumForestClockHand_02_0; // 0x588
    UStaticMeshComponent* SM_Sanc_Column1; // 0x590
    UStaticMeshComponent* SM_Sanc_Column; // 0x598
    UStaticMeshComponent* SM_Sanc_Wall_3x2; // 0x5a0
    UStaticMeshComponent* SM_Sanc_Alcove_01_Dwiz9; // 0x5a8
    UStaticMeshComponent* SM_Sanc_TerrariumForestBanister_01_Dwiz2_0_0; // 0x5b0
    UStaticMeshComponent* SM_Sanc_TerrariumForestBanister_01_Dwiz1_0_0; // 0x5b8
    UStaticMeshComponent* SM_Sanc_TerrariumForestBanister_01_Dwiz3_0_0; // 0x5c0
    UStaticMeshComponent* SM_Sanc_BanisterPost_01_Dwiz2_0_0; // 0x5c8
    UStaticMeshComponent* SM_Sanc_BanisterPost_01_Dwiz1_0_0; // 0x5d0
    UStaticMeshComponent* SM_Sanc_BanisterPost_01_Dwiz_0_0; // 0x5d8
    UStaticMeshComponent* SM_Sanc_TerrariumForestBanister_01_Dwiz6_0_0; // 0x5e0
    UStaticMeshComponent* SM_Sanc_BanisterPost_01_Dwiz5_0_0; // 0x5e8
    UStaticMeshComponent* SM_Sanc_BanisterPost_01_Dwiz4_0_0; // 0x5f0
    UStaticMeshComponent* SM_Sanc_TerrariumForestBanister_01_Dwiz4_0_0; // 0x5f8
    UStaticMeshComponent* SM_Sanc_TerrariumForestBanister_01_Dwiz5_0_0; // 0x600
    UStaticMeshComponent* SM_Sanc_BanisterPost_01_Dwiz3_0_0; // 0x608
    UStaticMeshComponent* SM_Sanc_OrnateDetail_01_Dwiz; // 0x610
    UStaticMeshComponent* SM_Sanc_TerrariumForestStart_02_Dwiz; // 0x618
    UStaticMeshComponent* SM_Sanc_Decal_01_Dwiz1; // 0x620
    UStaticMeshComponent* SM_Sanc_Bio_DressingDecal_Medium_01A4; // 0x628
    UStaticMeshComponent* SM_Sanc_Decal_01_Dwiz; // 0x630
    UStaticMeshComponent* SM_Sanc_Wall_10x2_Dwiz_02I; // 0x638
    UStaticMeshComponent* SM_Sanc_Wall_10x2_Dwiz_02H; // 0x640
    UStaticMeshComponent* SM_Sanc_Wall_10x2_Dwiz_02G; // 0x648
    UStaticMeshComponent* SM_Sanc_Wall_10x2_Dwiz_02F; // 0x650
    UStaticMeshComponent* SM_Sanc_Wall_10x2_Dwiz_02E; // 0x658
    UStaticMeshComponent* SM_Sanc_Wall_10x2_Dwiz_02D; // 0x660
    UStaticMeshComponent* SM_Sanc_Wall_10x2_Dwiz_02C; // 0x668
    UStaticMeshComponent* SM_Sanc_Wall_10x2_Dwiz_02B; // 0x670
    UStaticMeshComponent* SM_Sanc_Wall_10x2_Dwiz_02A; // 0x678
    UStaticMeshComponent* SM_Sanc_Wall_10x2_Dwiz_02; // 0x680
    UStaticMeshComponent* SM_Sanc_Wall_10x2_Dwiz_02I1; // 0x688
    UStaticMeshComponent* SM_Sanc_Wall_10x2_Dwiz_02H1; // 0x690
    UStaticMeshComponent* SM_Sanc_Wall_10x2_Dwiz_02G1; // 0x698
    UStaticMeshComponent* SM_Sanc_Wall_10x2_Dwiz_02F1; // 0x6a0
    UStaticMeshComponent* SM_Sanc_Wall_10x2_Dwiz_02E1; // 0x6a8
    UStaticMeshComponent* SM_Sanc_Wall_10x2_Dwiz_02D1; // 0x6b0
    UStaticMeshComponent* SM_Sanc_Wall_10x2_Dwiz_02C1; // 0x6b8
    UStaticMeshComponent* SM_Sanc_Wall_10x2_Dwiz_02B1; // 0x6c0
    UStaticMeshComponent* SM_Sanc_Wall_10x2_Dwiz_02A1; // 0x6c8
    UStaticMeshComponent* SM_Sanc_Wall_10x2_Dwiz_04; // 0x6d0
    UStaticMeshComponent* SM_Sanc_Column_04_Dwiz1; // 0x6d8
    UStaticMeshComponent* SM_Sanc_Column_04_Dwiz; // 0x6e0
    UStaticMeshComponent* SM_Sanc_Column_03_Dwiz1; // 0x6e8
    UStaticMeshComponent* SM_Sanc_Column_03_Dwiz; // 0x6f0
    UStaticMeshComponent* SM_Sanc_TerrariumForestStart_06_Dwiz; // 0x6f8
    UStaticMeshComponent* SM_Sanc_TerrariumForestStart_05_Dwiz; // 0x700
    UStaticMeshComponent* SM_Sanc_TerrariumForestStart_04_Dwiz; // 0x708
    UStaticMeshComponent* SM_Sanc_TerrariumForestStart_03_Dwiz; // 0x710
    UStaticMeshComponent* SM_Sanc_TerrariumForestStart_01_Dwiz; // 0x718
    UStaticMeshComponent* SM_Sanc_TerrariumForestStart_Dwiz; // 0x720
    UStaticMeshComponent* SM_Sanc_TerrariumForestClockStart_02_Dwiz; // 0x728
    UStaticMeshComponent* SM_Sanc_TerrariumForestClockStart_01_Dwiz; // 0x730
    UStaticMeshComponent* SM_Sanc_TerrariumForestClockStart_Dwiz; // 0x738
    UAkAudioEvent* AkEvent; // 0x740
    static ABP_Sanc_TerrariumForestStart_Dwiz_C* StaticClass();
    void ObjectPhysicalResponseImpact(float ImpactIntensity, FName SpellName, FName ResponseConfigName, FVector& ImpactLocation);
    void ExecuteUbergraph_BP_Sanc_TerrariumForestStart_Dwiz(int32_t EntryPoint, TArray<FAkExternalSourceInfo>& Temp_struct_Variable, float K2Node_Event_ImpactIntensity, FName K2Node_Event_SpellName, FName K2Node_Event_ResponseConfigName, FVector K2Node_Event_ImpactLocation, UAkComponent* CallFunc_SpawnAkComponentAtLocation_ReturnValue, bool CallFunc_Greater_FloatFloat_ReturnValue, FVector CallFunc_Conv_FloatToVector_ReturnValue);
}; // Size: 0x748
#pragma pack(pop)
