#pragma once
#include <cstdint>
#include "AMarker.hpp"
#include "FColor.hpp"
#include "FIntVector.hpp"
#include "FLinearColor.hpp"
#include "FPointerToUberGraphFrame.hpp"
#include "FRotator.hpp"
#include "FTransform.hpp"
#include "FVector.hpp"
class USceneComponent;
class UStaticMeshComponent;
class UMaterialInstanceDynamic;
class ULevel;
#pragma pack(push, 1)
class ABP_Marker_Base_C : public AMarker {
public:
    FPointerToUberGraphFrame UberGraphFrame; // 0x250
    USceneComponent* DefaultSceneRoot; // 0x258
    FString DB_Name; // 0x260
    FString BaseName; // 0x270
    int32_t UniqueIdentity; // 0x280
    char pad_284[0x4];
    FString UniqueIdentityName; // 0x288
    FString MarkerRootName; // 0x298
    FString OverrideMarkerName; // 0x2a8
    FString Arithmancy__; // 0x2b8
    bool Tile_Name_Off; // 0x2c8
    char pad_2c9[0x7];
    FString Level_Name; // 0x2d0
    bool Text_Display; // 0x2e0
    char pad_2e1[0x7];
    FString TEMP_Level_Name; // 0x2e8
    FRotator Text_Rotation; // 0x2f8
    char pad_304[0x4];
    static ABP_Marker_Base_C* StaticClass();
    void AddTextMarker(FString Text, float Height, float Size, FColor Color, FVector CallFunc_MakeVector_ReturnValue, FVector CallFunc_MakeVector_ReturnValue_1, FVector CallFunc_Add_VectorVector_ReturnValue, FVector CallFunc_Add_VectorVector_ReturnValue_1, FTransform CallFunc_MakeTransform_ReturnValue, FTransform CallFunc_MakeTransform_ReturnValue_1);
    void CreateBar(float Height, FColor Color, float CallFunc_Multiply_FloatFloat_ReturnValue, FLinearColor CallFunc_Conv_ColorToLinearColor_ReturnValue, FVector CallFunc_MakeVector_ReturnValue, float CallFunc_Multiply_FloatFloat_ReturnValue_1, FVector CallFunc_MakeVector_ReturnValue_1, FVector CallFunc_Add_VectorVector_ReturnValue, FTransform CallFunc_MakeTransform_ReturnValue, UStaticMeshComponent* CallFunc_AddComponent_ReturnValue, bool CallFunc_SetStaticMesh_ReturnValue, UMaterialInstanceDynamic* CallFunc_CreateDynamicMaterialInstance_ReturnValue, bool CallFunc_IsValid_ReturnValue);
    void CheckForTechLevel(bool& InTechLevel, bool& In_Mission, bool& In_Other, bool& Hogsmeade, bool& Feature, bool& VFX, ULevel* CallFunc_GetLevelFromActor_ReturnValue, FString CallFunc_GetPathName_ReturnValue, FString CallFunc_GetLevelName_ReturnValue, bool CallFunc_Contains_ReturnValue, bool CallFunc_Contains_ReturnValue_1, bool CallFunc_Contains_ReturnValue_2, bool CallFunc_Contains_ReturnValue_3, bool CallFunc_BooleanOR_ReturnValue, bool CallFunc_Contains_ReturnValue_4, bool CallFunc_Contains_ReturnValue_5, bool CallFunc_Contains_ReturnValue_6, bool CallFunc_BooleanOR_ReturnValue_1, bool CallFunc_Contains_ReturnValue_7, bool CallFunc_Contains_ReturnValue_8, bool CallFunc_BooleanOR_ReturnValue_2, bool CallFunc_BooleanOR_ReturnValue_3, bool CallFunc_Contains_ReturnValue_9);
    void InitMarker(float Height, float Size, FColor Color, FString MarkerRootName, int32_t SkipLeft, int32_t SkipRight, FString OverrideMarker_Name, FString Arithmancy__, bool Bar_Off, bool Tile_Name_Off, bool Text_Off, bool Rotate_Text_180, bool& Valid, bool CallFunc_Contains_ReturnValue, bool CallFunc_Contains_ReturnValue_1, bool CallFunc_BooleanOR_ReturnValue, bool CallFunc_Contains_ReturnValue_2, bool CallFunc_EqualEqual_StrStr_ReturnValue, bool CallFunc_Contains_ReturnValue_3, bool CallFunc_Contains_ReturnValue_4, bool CallFunc_Contains_ReturnValue_5, bool CallFunc_BooleanOR_ReturnValue_1, bool CallFunc_EqualEqual_StrStr_ReturnValue_1, bool CallFunc_BooleanOR_ReturnValue_2, bool CallFunc_BooleanOR_ReturnValue_3, bool CallFunc_BooleanOR_ReturnValue_4, bool CallFunc_Contains_ReturnValue_6, bool CallFunc_Contains_ReturnValue_7, bool CallFunc_Contains_ReturnValue_8, bool CallFunc_NotEqual_StrStr_ReturnValue, bool CallFunc_BooleanOR_ReturnValue_5, bool CallFunc_BooleanOR_ReturnValue_6, FColor K2Node_MakeStruct_Color, bool CallFunc_CheckForTechLevel_InTechLevel, bool CallFunc_CheckForTechLevel_In_Mission, bool CallFunc_CheckForTechLevel_In_Other, bool CallFunc_CheckForTechLevel_Hogsmeade, bool CallFunc_CheckForTechLevel_Feature, bool CallFunc_CheckForTechLevel_VFX);
    void SetUniqueIdentity(TArray<FString> IDtoName, TArray<FString> UniqueNames, TArray<FString>& K2Node_MakeArray_Array, FString CallFunc_Concat_StrStr_ReturnValue, FVector CallFunc_K2_GetActorLocation_ReturnValue, FIntVector CallFunc_FTruncVector_ReturnValue, FString CallFunc_Conv_IntVectorToString_ReturnValue, FString CallFunc_Concat_StrStr_ReturnValue_1, FString CallFunc_Concat_StrStr_ReturnValue_2, FString CallFunc_Concat_StrStr_ReturnValue_3);
    void SetBaseName(int32_t SkipLeft, int32_t SkipRight, bool CallFunc_Contains_ReturnValue, FString CallFunc_RightChop_ReturnValue, FString CallFunc_Concat_StrStr_ReturnValue, bool CallFunc_Contains_ReturnValue_1, FString CallFunc_RightChop_ReturnValue_1, FString CallFunc_Concat_StrStr_ReturnValue_1, bool CallFunc_Contains_ReturnValue_2, FString CallFunc_RightChop_ReturnValue_2, FString CallFunc_Concat_StrStr_ReturnValue_2, bool CallFunc_Contains_ReturnValue_3, bool CallFunc_Contains_ReturnValue_4, FString CallFunc_RightChop_ReturnValue_3, FString CallFunc_Concat_StrStr_ReturnValue_3, FString CallFunc_RightChop_ReturnValue_4, FString CallFunc_Concat_StrStr_ReturnValue_4, bool CallFunc_Contains_ReturnValue_5, FString CallFunc_RightChop_ReturnValue_5, bool CallFunc_Contains_ReturnValue_6, FString CallFunc_Concat_StrStr_ReturnValue_5, FString CallFunc_RightChop_ReturnValue_6, bool CallFunc_Contains_ReturnValue_7, FString CallFunc_Concat_StrStr_ReturnValue_6, FString CallFunc_RightChop_ReturnValue_7, bool CallFunc_Contains_ReturnValue_8, FString CallFunc_Concat_StrStr_ReturnValue_7, FString CallFunc_RightChop_ReturnValue_8, bool CallFunc_Contains_ReturnValue_9, FString CallFunc_Concat_StrStr_ReturnValue_8, bool CallFunc_Contains_ReturnValue_10, FString CallFunc_RightChop_ReturnValue_9, FString CallFunc_Concat_StrStr_ReturnValue_9, FString CallFunc_RightChop_ReturnValue_10, FString CallFunc_Concat_StrStr_ReturnValue_10, bool CallFunc_Contains_ReturnValue_11, FString CallFunc_RightChop_ReturnValue_11, FString CallFunc_Concat_StrStr_ReturnValue_11, bool CallFunc_Contains_ReturnValue_12, FString CallFunc_RightChop_ReturnValue_12, FString CallFunc_Concat_StrStr_ReturnValue_12, bool CallFunc_Contains_ReturnValue_13, FString CallFunc_RightChop_ReturnValue_13, FString CallFunc_Concat_StrStr_ReturnValue_13, bool CallFunc_Contains_ReturnValue_14, FString CallFunc_RightChop_ReturnValue_14, FString CallFunc_Concat_StrStr_ReturnValue_14, bool CallFunc_Contains_ReturnValue_15, FString CallFunc_RightChop_ReturnValue_15, FString CallFunc_Concat_StrStr_ReturnValue_15, bool CallFunc_Contains_ReturnValue_16, FString CallFunc_RightChop_ReturnValue_16, FString CallFunc_Concat_StrStr_ReturnValue_16, bool CallFunc_Contains_ReturnValue_17, FString CallFunc_RightChop_ReturnValue_17, FString CallFunc_Concat_StrStr_ReturnValue_17, bool CallFunc_Contains_ReturnValue_18, bool CallFunc_Contains_ReturnValue_19, FString CallFunc_RightChop_ReturnValue_18, FString CallFunc_Concat_StrStr_ReturnValue_18, FString CallFunc_RightChop_ReturnValue_19, FString CallFunc_Concat_StrStr_ReturnValue_19, bool CallFunc_Contains_ReturnValue_20, FString CallFunc_RightChop_ReturnValue_20, FString CallFunc_Concat_StrStr_ReturnValue_20, bool CallFunc_Contains_ReturnValue_21, FString CallFunc_RightChop_ReturnValue_21, FString CallFunc_Concat_StrStr_ReturnValue_21, FString CallFunc_Concat_StrStr_ReturnValue_22, FString CallFunc_RightChop_ReturnValue_22, bool CallFunc_Contains_ReturnValue_22, FString CallFunc_Concat_StrStr_ReturnValue_23, FString CallFunc_Concat_StrStr_ReturnValue_24, FString CallFunc_GetPathName_ReturnValue, bool CallFunc_Contains_ReturnValue_23, bool CallFunc_Contains_ReturnValue_24, FString CallFunc_Concat_StrStr_ReturnValue_25, FString CallFunc_RightChop_ReturnValue_23, FString CallFunc_RightChop_ReturnValue_24, FString CallFunc_Concat_StrStr_ReturnValue_26, bool CallFunc_Contains_ReturnValue_25, FString CallFunc_Concat_StrStr_ReturnValue_27, FString CallFunc_LeftChop_ReturnValue, FString CallFunc_RightChop_ReturnValue_25, bool CallFunc_Contains_ReturnValue_26, FString CallFunc_Concat_StrStr_ReturnValue_28, FString CallFunc_Concat_StrStr_ReturnValue_29, bool CallFunc_Contains_ReturnValue_27, bool CallFunc_BooleanAND_ReturnValue, bool CallFunc_EqualEqual_StrStr_ReturnValue, bool CallFunc_Contains_ReturnValue_28, FString CallFunc_RightChop_ReturnValue_26, FString CallFunc_Concat_StrStr_ReturnValue_30, bool CallFunc_Contains_ReturnValue_29, FString CallFunc_RightChop_ReturnValue_27, FString CallFunc_Concat_StrStr_ReturnValue_31, bool CallFunc_Contains_ReturnValue_30, FString CallFunc_RightChop_ReturnValue_28, FString CallFunc_Concat_StrStr_ReturnValue_32, bool CallFunc_Contains_ReturnValue_31, FString CallFunc_RightChop_ReturnValue_29, FString CallFunc_Concat_StrStr_ReturnValue_33, bool CallFunc_Contains_ReturnValue_32, FString CallFunc_RightChop_ReturnValue_30, FString CallFunc_Concat_StrStr_ReturnValue_34, FString CallFunc_Replace_ReturnValue, bool CallFunc_Contains_ReturnValue_33, FString CallFunc_Concat_StrStr_ReturnValue_35, bool CallFunc_Contains_ReturnValue_34, bool CallFunc_Contains_ReturnValue_35, bool CallFunc_Contains_ReturnValue_36, FString CallFunc_RightChop_ReturnValue_31, bool CallFunc_Contains_ReturnValue_37, FString CallFunc_Concat_StrStr_ReturnValue_36, FString CallFunc_LeftChop_ReturnValue_1, FString CallFunc_Concat_StrStr_ReturnValue_37, bool CallFunc_Contains_ReturnValue_38, bool CallFunc_Contains_ReturnValue_39, FString CallFunc_RightChop_ReturnValue_32, bool CallFunc_BooleanAND_ReturnValue_1, FString CallFunc_Concat_StrStr_ReturnValue_38, bool CallFunc_BooleanOR_ReturnValue, bool CallFunc_Contains_ReturnValue_40, bool CallFunc_Contains_ReturnValue_41, bool CallFunc_Contains_ReturnValue_42, bool CallFunc_BooleanOR_ReturnValue_1, bool CallFunc_BooleanOR_ReturnValue_2, bool CallFunc_Contains_ReturnValue_43, bool CallFunc_BooleanOR_ReturnValue_3, bool CallFunc_BooleanOR_ReturnValue_4, bool CallFunc_BooleanOR_ReturnValue_5, FString CallFunc_Left_ReturnValue, bool CallFunc_Contains_ReturnValue_44, FString CallFunc_Concat_StrStr_ReturnValue_39, bool CallFunc_Contains_ReturnValue_45, FString CallFunc_Concat_StrStr_ReturnValue_40, bool CallFunc_Contains_ReturnValue_46, bool CallFunc_BooleanOR_ReturnValue_6, bool CallFunc_BooleanOR_ReturnValue_7, bool CallFunc_Contains_ReturnValue_47, bool CallFunc_Contains_ReturnValue_48, bool CallFunc_Contains_ReturnValue_49, bool CallFunc_Contains_ReturnValue_50, bool CallFunc_Contains_ReturnValue_51, bool CallFunc_Contains_ReturnValue_52, bool CallFunc_Contains_ReturnValue_53, bool CallFunc_Contains_ReturnValue_54, bool CallFunc_BooleanOR_ReturnValue_8, bool CallFunc_Contains_ReturnValue_55, bool CallFunc_BooleanOR_ReturnValue_9, bool CallFunc_BooleanOR_ReturnValue_10, bool CallFunc_BooleanOR_ReturnValue_11, bool CallFunc_BooleanOR_ReturnValue_12, bool CallFunc_BooleanOR_ReturnValue_13, bool CallFunc_BooleanOR_ReturnValue_14, bool CallFunc_BooleanOR_ReturnValue_15, bool CallFunc_Contains_ReturnValue_56, FString CallFunc_LeftChop_ReturnValue_2, FString CallFunc_RightChop_ReturnValue_33, bool CallFunc_Contains_ReturnValue_57, bool CallFunc_Contains_ReturnValue_58, FString CallFunc_RightChop_ReturnValue_34, FString CallFunc_LeftChop_ReturnValue_3, FString CallFunc_Concat_StrStr_ReturnValue_41, FString CallFunc_RightChop_ReturnValue_35, FString CallFunc_LeftChop_ReturnValue_4, FString CallFunc_LeftChop_ReturnValue_5, FString CallFunc_RightChop_ReturnValue_36, FString CallFunc_RightChop_ReturnValue_37, FString CallFunc_LeftChop_ReturnValue_6, FString CallFunc_LeftChop_ReturnValue_7, FString CallFunc_RightChop_ReturnValue_38, FString CallFunc_RightChop_ReturnValue_39, FString CallFunc_Left_ReturnValue_1, FString CallFunc_RightChop_ReturnValue_40, FString CallFunc_Concat_StrStr_ReturnValue_42, FString CallFunc_Concat_StrStr_ReturnValue_43, FString CallFunc_Concat_StrStr_ReturnValue_44, FString CallFunc_Concat_StrStr_ReturnValue_45, bool CallFunc_Contains_ReturnValue_59, FString CallFunc_LeftChop_ReturnValue_8, FString CallFunc_Concat_StrStr_ReturnValue_46, FString CallFunc_RightChop_ReturnValue_41, FString CallFunc_Concat_StrStr_ReturnValue_47, bool CallFunc_Contains_ReturnValue_60, FString CallFunc_Concat_StrStr_ReturnValue_48, bool CallFunc_Contains_ReturnValue_61, FString CallFunc_Concat_StrStr_ReturnValue_49, FString CallFunc_RightChop_ReturnValue_42, FString CallFunc_Concat_StrStr_ReturnValue_50, FString CallFunc_Concat_StrStr_ReturnValue_51, FString CallFunc_Concat_StrStr_ReturnValue_52, FString CallFunc_Concat_StrStr_ReturnValue_53, FString CallFunc_LeftChop_ReturnValue_9, FString CallFunc_Concat_StrStr_ReturnValue_54, FString CallFunc_Concat_StrStr_ReturnValue_55, FString CallFunc_Concat_StrStr_ReturnValue_56, bool CallFunc_Contains_ReturnValue_62, FString CallFunc_Concat_StrStr_ReturnValue_57, FString CallFunc_Concat_StrStr_ReturnValue_58, FString CallFunc_Concat_StrStr_ReturnValue_59, FString CallFunc_Concat_StrStr_ReturnValue_60, FString CallFunc_Concat_StrStr_ReturnValue_61, bool CallFunc_Contains_ReturnValue_63, FString CallFunc_Concat_StrStr_ReturnValue_62, bool CallFunc_Contains_ReturnValue_64, bool CallFunc_Contains_ReturnValue_65, bool CallFunc_BooleanOR_ReturnValue_16, FString CallFunc_Concat_StrStr_ReturnValue_63, bool CallFunc_BooleanOR_ReturnValue_17, FString CallFunc_Concat_StrStr_ReturnValue_64, bool CallFunc_EqualEqual_StrStr_ReturnValue_1, FString CallFunc_Concat_StrStr_ReturnValue_65, ULevel* CallFunc_GetLevelFromActor_ReturnValue, FString CallFunc_GetLevelName_ReturnValue, bool CallFunc_Contains_ReturnValue_66);
    void ReceiveBeginPlay();
    void ExecuteUbergraph_BP_Marker_Base(int32_t EntryPoint);
}; // Size: 0x308
#pragma pack(pop)
