#pragma once
#include <cstdint>
#include "AActor.hpp"
class UStaticMeshComponent;
class USceneComponent;
#pragma pack(push, 1)
class ABP_CastleRuins1_RuinPiece_D_C : public AActor {
public:
    UStaticMeshComponent* SM_CastleRuins_1_Top_Trim_Cap_C6_363; // 0x248
    UStaticMeshComponent* SM_CastleRuins_1_Broken_End_cap_C2_361; // 0x250
    UStaticMeshComponent* SM_CastleRuins_1_Broken_End_cap_C_359; // 0x258
    UStaticMeshComponent* SM_CastleRuins_1_Pillar_Variant_A_357; // 0x260
    UStaticMeshComponent* SM_CastleRuins_1_Top_Trim_Cap_A_355; // 0x268
    UStaticMeshComponent* SM_CastleRuins_1_Top_Trim_Cap_C5_353; // 0x270
    UStaticMeshComponent* SM_CastleRuins_1_Bottom_Wall_Damaged_A_351; // 0x278
    UStaticMeshComponent* SM_CastleRuins_1_Top_Trim_Cap_C4_349; // 0x280
    UStaticMeshComponent* SM_CastleRuins_1_Top_Trim_Cap_C3_347; // 0x288
    UStaticMeshComponent* SM_CastleRuins_1_Top_Trim_Cap_C2_345; // 0x290
    UStaticMeshComponent* SM_CastleRuins_1_Top_Trim_Cap_C_343; // 0x298
    USceneComponent* SharedRoot; // 0x2a0
    static ABP_CastleRuins1_RuinPiece_D_C* StaticClass();
}; // Size: 0x2a8
#pragma pack(pop)
