#pragma once
#include <cstdint>
#include "ABP_Sanc_HubArchway_02_Parent_C.hpp"
class UStaticMeshComponent;
class USceneComponent;
class UDecalComponent;
class UChildActorComponent;
class UTransformationFxInfoComponent;
#pragma pack(push, 1)
class ABP_Sanc_HubArchway_02_Potnr_C : public ABP_Sanc_HubArchway_02_Parent_C {
public:
    UStaticMeshComponent* SM_Sanc_Alcove_01_Dwiz; // 0x2b8
    UStaticMeshComponent* SM_Sanc_Alcove_01_Dwiz6; // 0x2c0
    UStaticMeshComponent* SM_Sanc_Alcove_01_Dwiz5; // 0x2c8
    UStaticMeshComponent* SM_Sanc_Alcove_01_Dwiz4; // 0x2d0
    UStaticMeshComponent* SM_Sanc_Alcove_01_Dwiz2; // 0x2d8
    UStaticMeshComponent* SM_Sanc_Alcove_01_Dwiz1; // 0x2e0
    UStaticMeshComponent* SM_Sanc_StairsBase_01A_Potnr; // 0x2e8
    UStaticMeshComponent* SM_Sanc_StairsBase_01B_Potnr; // 0x2f0
    UStaticMeshComponent* SM_Sanc_Alcove_01_Dwiz7; // 0x2f8
    USceneComponent* DefaultSceneRoot12; // 0x300
    UDecalComponent* Decal1; // 0x308
    UDecalComponent* Decal; // 0x310
    UStaticMeshComponent* SM_Sanc_Column_02_Potnr; // 0x318
    UStaticMeshComponent* SM_Sanc_Alcove_01_Dwiz3; // 0x320
    UChildActorComponent* BP_Sanc_LightFixtureDownwardsDirectional_01_Potnr; // 0x328
    UStaticMeshComponent* SM_Sanc_Alcove_01_Dwiz8; // 0x330
    UStaticMeshComponent* StaticMesh; // 0x338
    UStaticMeshComponent* SM_Sanc_Column_02_Potnr1; // 0x340
    UChildActorComponent* BP_Sanc_LightFixtureOmniDirectional_01_Potnr1; // 0x348
    UChildActorComponent* BP_Sanc_LightFixtureOmniDirectional_01_Potnr; // 0x350
    UTransformationFxInfoComponent* TransformationFxInfo1; // 0x358
    USceneComponent* DefaultSceneRoot7; // 0x360
    USceneComponent* DefaultSceneRoot4; // 0x368
    USceneComponent* Scene; // 0x370
    USceneComponent* Scene1; // 0x378
    USceneComponent* DefaultSceneRoot2; // 0x380
    USceneComponent* DefaultSceneRoot1; // 0x388
    static ABP_Sanc_HubArchway_02_Potnr_C* StaticClass();
}; // Size: 0x390
#pragma pack(pop)
