#pragma once
#include <cstdint>
#include "AActor.hpp"
class UBP_ID_WallCandles_Master_C;
class UPhysicalResponseComponent;
class UMaterialBillboardComponent;
class UAnimatedLightComponent;
class UPointLightComponent;
class UStaticMeshComponent;
class USceneComponent;
#pragma pack(push, 1)
class ABP_Sanc_HubCorner_03_Dwiz_Dressing01_C : public AActor {
public:
    UBP_ID_WallCandles_Master_C* BP_ID_WallCandles_Master; // 0x248
    UAnimatedLightComponent* AnimatedLight1; // 0x250
    UPointLightComponent* PointLight1; // 0x258
    UStaticMeshComponent* SM_HW_L_New_Book_F1; // 0x260
    UPhysicalResponseComponent* PhysicalResponse12; // 0x268
    UStaticMeshComponent* SM_HM_Quill_Rolled_Parchment_A2; // 0x270
    UPhysicalResponseComponent* PhysicalResponse1; // 0x278
    UStaticMeshComponent* SM_HM_Quill_Rolled_Parchment_A3; // 0x280
    UPhysicalResponseComponent* PhysicalResponse; // 0x288
    UStaticMeshComponent* SM_HW_L_New_Book_A2; // 0x290
    UPhysicalResponseComponent* PhysicalResponse77; // 0x298
    UStaticMeshComponent* StaticMeshComponent027; // 0x2a0
    UPhysicalResponseComponent* PhysicalResponse76; // 0x2a8
    UStaticMeshComponent* SM_HW_L_New_Book_A1; // 0x2b0
    UPhysicalResponseComponent* PhysicalResponse75; // 0x2b8
    UStaticMeshComponent* SM_HW_DAO_JewelryBox_A; // 0x2c0
    UPhysicalResponseComponent* PhysicalResponse74; // 0x2c8
    UMaterialBillboardComponent* MaterialBillboard13; // 0x2d0
    UStaticMeshComponent* StaticMeshComponent013; // 0x2d8
    UPhysicalResponseComponent* PhysicalResponse92; // 0x2e0
    UMaterialBillboardComponent* MaterialBillboard14; // 0x2e8
    UStaticMeshComponent* StaticMeshComponent014; // 0x2f0
    UPhysicalResponseComponent* PhysicalResponse91; // 0x2f8
    UMaterialBillboardComponent* MaterialBillboard16; // 0x300
    UStaticMeshComponent* StaticMeshComponent016; // 0x308
    UStaticMeshComponent* StaticMeshComponent03; // 0x310
    UPhysicalResponseComponent* PhysicalResponse89; // 0x318
    UStaticMeshComponent* StaticMeshComponent05; // 0x320
    UPhysicalResponseComponent* PhysicalResponse88; // 0x328
    UStaticMeshComponent* SM_HM_3Broom_Jug_C1; // 0x330
    UPhysicalResponseComponent* PhysicalResponse87; // 0x338
    UStaticMeshComponent* SM_HM_Quill_Rolled_Parchment_Pile_A1; // 0x340
    UPhysicalResponseComponent* PhysicalResponse86; // 0x348
    UStaticMeshComponent* SM_HM_InkBottleWithQuills_A1; // 0x350
    UPhysicalResponseComponent* PhysicalResponse85; // 0x358
    UStaticMeshComponent* SM_HW_DAO_DragonUrn; // 0x360
    UPhysicalResponseComponent* PhysicalResponse52; // 0x368
    UStaticMeshComponent* SM_Sanc_SkullJar_Dwiz_01A; // 0x370
    UPhysicalResponseComponent* PhysicalResponse51; // 0x378
    UStaticMeshComponent* SM_HW_HourGlass_D1; // 0x380
    UPhysicalResponseComponent* PhysicalResponse50; // 0x388
    UStaticMeshComponent* SM_Sanc_Jar_Dwiz_01A; // 0x390
    UStaticMeshComponent* SM_Sanc_Decal_02_Dwiz; // 0x398
    UPhysicalResponseComponent* PhysicalResponse49; // 0x3a0
    UMaterialBillboardComponent* MaterialBillboard15; // 0x3a8
    UStaticMeshComponent* StaticMeshComponent04; // 0x3b0
    UPhysicalResponseComponent* PhysicalResponse90; // 0x3b8
    USceneComponent* CornerWall_WallPiece_05; // 0x3c0
    USceneComponent* SceneRoot; // 0x3c8
    static ABP_Sanc_HubCorner_03_Dwiz_Dressing01_C* StaticClass();
}; // Size: 0x3d0
#pragma pack(pop)
