#pragma once
#include <cstdint>
#include "AActor.hpp"
#include "FHitResult.hpp"
#include "FTransform.hpp"
#include "FVector.hpp"
class USceneComponent;
class UStaticMesh;
class USplineMeshComponent;
class USplineComponent;
#pragma pack(push, 1)
class ABP_OL_Spline_Parent_B_C : public AActor {
public:
    USceneComponent* DefaultSceneRoot; // 0x248
    bool ReOrderMesh; // 0x250
    char pad_251[0x57];
    TArray<int32_t> Set_to_A; // 0x2a8
    TArray<int32_t> Set_to_B; // 0x2b8
    TArray<int32_t> Set_to_C; // 0x2c8
    TArray<int32_t> Set_to_D; // 0x2d8
    TArray<int32_t> Set_To_E; // 0x2e8
    TArray<int32_t> Set_To_F; // 0x2f8
    bool Tag_Visibility; // 0x308
    char pad_309[0x3];
    int32_t Last_Index; // 0x30c
    FString String; // 0x310
    FString String_2; // 0x320
    FString String_3; // 0x330
    TArray<int32_t> Index_Of_Duplicate; // 0x340
    char pad_350[0x28];
    bool You_Did_Something_Wrong; // 0x378
    char pad_379[0x57];
    TArray<int32_t> NewVar_0; // 0x3d0
    static ABP_OL_Spline_Parent_B_C* StaticClass();
    void ReOrder_II(UStaticMesh* A, UStaticMesh* B, UStaticMesh* C, UStaticMesh* D, UStaticMesh* E, UStaticMesh* F, TArray<int32_t> INDEX_HOLDER, int32_t Temp_int_Array_Index_Variable, TArray<int32_t>& CallFunc_Map_Values_Values, TArray<int32_t>& CallFunc_Map_Keys_Keys, int32_t CallFunc_Array_Get_Item, int32_t CallFunc_Array_Get_Item_1, int32_t CallFunc_Array_Length_ReturnValue, int32_t Temp_int_Loop_Counter_Variable, TArray<int32_t>& CallFunc_Map_Values_Values_1, TArray<USplineMeshComponent*>& CallFunc_Map_Keys_Keys_1, int32_t CallFunc_Array_Get_Item_2, bool CallFunc_Array_Contains_ReturnValue, USplineMeshComponent* CallFunc_Array_Get_Item_3, bool CallFunc_Less_IntInt_ReturnValue, int32_t CallFunc_Add_IntInt_ReturnValue, int32_t Temp_int_Variable, UStaticMesh* K2Node_Select_Default, bool CallFunc_SetStaticMesh_ReturnValue);
    void SelfCompare(TArray<int32_t>& ArrayInput, bool& containsDuplicate, int32_t& indexOfDuplicate, TArray<int32_t> Temp, int32_t CallFunc_Array_Length_ReturnValue, bool Temp_bool_True_if_break_was_hit_Variable, int32_t Temp_int_Array_Index_Variable, int32_t CallFunc_Array_Get_Item, bool CallFunc_Not_PreBool_ReturnValue, int32_t Temp_int_Loop_Counter_Variable, int32_t CallFunc_Array_Add_ReturnValue, bool CallFunc_Array_Contains_ReturnValue, bool CallFunc_Less_IntInt_ReturnValue, bool CallFunc_BooleanAND_ReturnValue, int32_t CallFunc_Add_IntInt_ReturnValue);
    void Array_Compare(int32_t Temp_int_Array_Index_Variable, int32_t Temp_int_Loop_Counter_Variable, int32_t CallFunc_Add_IntInt_ReturnValue, int32_t Temp_int_Loop_Counter_Variable_1, int32_t CallFunc_Add_IntInt_ReturnValue_1, int32_t Temp_int_Array_Index_Variable_1, int32_t Temp_int_Array_Index_Variable_2, int32_t Temp_int_Loop_Counter_Variable_2, int32_t CallFunc_Add_IntInt_ReturnValue_2, int32_t Temp_int_Array_Index_Variable_3, int32_t Temp_int_Loop_Counter_Variable_3, int32_t CallFunc_Add_IntInt_ReturnValue_3, int32_t Temp_int_Loop_Counter_Variable_4, int32_t Temp_int_Loop_Counter_Variable_5, int32_t CallFunc_Add_IntInt_ReturnValue_4, int32_t CallFunc_Add_IntInt_ReturnValue_5, int32_t Temp_int_Array_Index_Variable_4, int32_t CallFunc_Array_Length_ReturnValue, int32_t CallFunc_Array_Get_Item, bool CallFunc_Less_IntInt_ReturnValue, bool CallFunc_Array_Contains_ReturnValue, bool CallFunc_Array_Contains_ReturnValue_1, int32_t CallFunc_Array_Length_ReturnValue_1, bool CallFunc_SelfCompare_containsDuplicate, int32_t CallFunc_SelfCompare_indexOfDuplicate, bool CallFunc_Less_IntInt_ReturnValue_1, bool CallFunc_SelfCompare_containsDuplicate_1, int32_t CallFunc_SelfCompare_indexOfDuplicate_1, int32_t Temp_int_Array_Index_Variable_5, bool CallFunc_Greater_IntInt_ReturnValue, int32_t CallFunc_Array_Get_Item_1, bool CallFunc_Array_Contains_ReturnValue_2, bool CallFunc_Array_Contains_ReturnValue_3, bool CallFunc_Greater_IntInt_ReturnValue_1, bool CallFunc_Array_Contains_ReturnValue_4, bool CallFunc_Array_Contains_ReturnValue_5, bool CallFunc_Array_Contains_ReturnValue_6, bool CallFunc_BooleanOR_ReturnValue, bool CallFunc_BooleanOR_ReturnValue_1, bool CallFunc_BooleanOR_ReturnValue_2, bool CallFunc_Array_Contains_ReturnValue_7, bool CallFunc_BooleanOR_ReturnValue_3, bool CallFunc_BooleanOR_ReturnValue_4, bool CallFunc_Array_Contains_ReturnValue_8, bool CallFunc_Array_Contains_ReturnValue_9, bool CallFunc_BooleanOR_ReturnValue_5, bool CallFunc_BooleanOR_ReturnValue_6, bool CallFunc_BooleanOR_ReturnValue_7, bool CallFunc_BooleanOR_ReturnValue_8, bool CallFunc_BooleanOR_ReturnValue_9, int32_t CallFunc_Array_Get_Item_2, int32_t CallFunc_Array_Length_ReturnValue_2, bool CallFunc_Array_Contains_ReturnValue_10, bool CallFunc_Less_IntInt_ReturnValue_2, bool CallFunc_Array_Contains_ReturnValue_11, bool CallFunc_Greater_IntInt_ReturnValue_2, bool CallFunc_Array_Contains_ReturnValue_12, bool CallFunc_SelfCompare_containsDuplicate_2, int32_t CallFunc_SelfCompare_indexOfDuplicate_2, bool CallFunc_Array_Contains_ReturnValue_13, bool CallFunc_Array_Contains_ReturnValue_14, bool CallFunc_BooleanOR_ReturnValue_10, bool CallFunc_BooleanOR_ReturnValue_11, int32_t CallFunc_Array_Get_Item_3, bool CallFunc_BooleanOR_ReturnValue_12, bool CallFunc_Array_Contains_ReturnValue_15, bool CallFunc_BooleanOR_ReturnValue_13, bool CallFunc_Array_Contains_ReturnValue_16, bool CallFunc_BooleanOR_ReturnValue_14, bool CallFunc_Greater_IntInt_ReturnValue_3, bool CallFunc_Array_Contains_ReturnValue_17, int32_t CallFunc_Array_Length_ReturnValue_3, bool CallFunc_SelfCompare_containsDuplicate_3, int32_t CallFunc_SelfCompare_indexOfDuplicate_3, bool CallFunc_Less_IntInt_ReturnValue_3, bool CallFunc_Array_Contains_ReturnValue_18, bool CallFunc_Array_Contains_ReturnValue_19, bool CallFunc_BooleanOR_ReturnValue_15, bool CallFunc_BooleanOR_ReturnValue_16, bool CallFunc_BooleanOR_ReturnValue_17, int32_t CallFunc_Array_Get_Item_4, bool CallFunc_BooleanOR_ReturnValue_18, bool CallFunc_Array_Contains_ReturnValue_20, bool CallFunc_BooleanOR_ReturnValue_19, bool CallFunc_Array_Contains_ReturnValue_21, bool CallFunc_Greater_IntInt_ReturnValue_4, bool CallFunc_Array_Contains_ReturnValue_22, bool CallFunc_Array_Contains_ReturnValue_23, int32_t CallFunc_Array_Length_ReturnValue_4, bool CallFunc_SelfCompare_containsDuplicate_4, int32_t CallFunc_SelfCompare_indexOfDuplicate_4, bool CallFunc_Less_IntInt_ReturnValue_4, bool CallFunc_Array_Contains_ReturnValue_24, bool CallFunc_BooleanOR_ReturnValue_20, bool CallFunc_BooleanOR_ReturnValue_21, bool CallFunc_BooleanOR_ReturnValue_22, bool CallFunc_BooleanOR_ReturnValue_23, bool CallFunc_BooleanOR_ReturnValue_24, int32_t CallFunc_Array_Get_Item_5, bool CallFunc_Array_Contains_ReturnValue_25, bool CallFunc_Array_Contains_ReturnValue_26, bool CallFunc_Greater_IntInt_ReturnValue_5, bool CallFunc_Array_Contains_ReturnValue_27, bool CallFunc_Array_Contains_ReturnValue_28, bool CallFunc_Array_Contains_ReturnValue_29, bool CallFunc_SelfCompare_containsDuplicate_5, int32_t CallFunc_SelfCompare_indexOfDuplicate_5, int32_t CallFunc_Array_Length_ReturnValue_5, bool CallFunc_BooleanOR_ReturnValue_25, bool CallFunc_Less_IntInt_ReturnValue_5, bool CallFunc_BooleanOR_ReturnValue_26, bool CallFunc_BooleanOR_ReturnValue_27, bool CallFunc_BooleanOR_ReturnValue_28, bool CallFunc_BooleanOR_ReturnValue_29);
    void Fix_Array_Limit(int32_t Temp_int_Array_Index_Variable, int32_t Temp_int_Loop_Counter_Variable, int32_t CallFunc_Add_IntInt_ReturnValue, int32_t Temp_int_Loop_Counter_Variable_1, int32_t CallFunc_Add_IntInt_ReturnValue_1, int32_t Temp_int_Array_Index_Variable_1, int32_t Temp_int_Array_Index_Variable_2, int32_t Temp_int_Loop_Counter_Variable_2, int32_t CallFunc_Add_IntInt_ReturnValue_2, int32_t Temp_int_Array_Index_Variable_3, int32_t Temp_int_Loop_Counter_Variable_3, int32_t CallFunc_Add_IntInt_ReturnValue_3, int32_t Temp_int_Loop_Counter_Variable_4, int32_t Temp_int_Loop_Counter_Variable_5, int32_t CallFunc_Add_IntInt_ReturnValue_4, int32_t CallFunc_Add_IntInt_ReturnValue_5, int32_t Temp_int_Array_Index_Variable_4, int32_t CallFunc_Array_Length_ReturnValue, bool CallFunc_Less_IntInt_ReturnValue, int32_t CallFunc_Array_Get_Item, int32_t CallFunc_Array_Length_ReturnValue_1, bool CallFunc_Less_IntInt_ReturnValue_1, int32_t Temp_int_Array_Index_Variable_5, int32_t CallFunc_Array_Get_Item_1, bool CallFunc_Greater_IntInt_ReturnValue, int32_t CallFunc_Array_Get_Item_2, int32_t CallFunc_Array_Length_ReturnValue_2, bool CallFunc_Greater_IntInt_ReturnValue_1, bool CallFunc_Less_IntInt_ReturnValue_2, int32_t CallFunc_Array_Get_Item_3, int32_t CallFunc_Array_Get_Item_4, int32_t CallFunc_Array_Length_ReturnValue_3, int32_t CallFunc_Array_Length_ReturnValue_4, bool CallFunc_Less_IntInt_ReturnValue_3, bool CallFunc_Less_IntInt_ReturnValue_4, bool CallFunc_Greater_IntInt_ReturnValue_2, bool CallFunc_Greater_IntInt_ReturnValue_3, int32_t CallFunc_Array_Get_Item_5, int32_t CallFunc_Array_Length_ReturnValue_5, bool CallFunc_Greater_IntInt_ReturnValue_4, bool CallFunc_Less_IntInt_ReturnValue_5, bool CallFunc_Greater_IntInt_ReturnValue_5);
    void Check_Array_Limit(int32_t Temp_int_Array_Index_Variable, int32_t Temp_int_Loop_Counter_Variable, int32_t CallFunc_Add_IntInt_ReturnValue, int32_t Temp_int_Loop_Counter_Variable_1, int32_t CallFunc_Add_IntInt_ReturnValue_1, int32_t Temp_int_Array_Index_Variable_1, int32_t Temp_int_Array_Index_Variable_2, int32_t Temp_int_Loop_Counter_Variable_2, int32_t CallFunc_Add_IntInt_ReturnValue_2, int32_t Temp_int_Array_Index_Variable_3, int32_t Temp_int_Loop_Counter_Variable_3, int32_t CallFunc_Add_IntInt_ReturnValue_3, int32_t Temp_int_Loop_Counter_Variable_4, int32_t Temp_int_Loop_Counter_Variable_5, int32_t CallFunc_Add_IntInt_ReturnValue_4, int32_t CallFunc_Add_IntInt_ReturnValue_5, int32_t Temp_int_Array_Index_Variable_4, int32_t CallFunc_Array_Length_ReturnValue, bool CallFunc_Less_IntInt_ReturnValue, int32_t CallFunc_Array_Get_Item, int32_t CallFunc_Array_Length_ReturnValue_1, bool CallFunc_Less_IntInt_ReturnValue_1, FString CallFunc_Concat_StrStr_ReturnValue, int32_t Temp_int_Array_Index_Variable_5, FString CallFunc_Concat_StrStr_ReturnValue_1, int32_t CallFunc_Array_Get_Item_1, bool CallFunc_Greater_IntInt_ReturnValue, bool CallFunc_Greater_IntInt_ReturnValue_1, FString CallFunc_Concat_StrStr_ReturnValue_2, FString CallFunc_Concat_StrStr_ReturnValue_3, FString CallFunc_Concat_StrStr_ReturnValue_4, FString CallFunc_Concat_StrStr_ReturnValue_5, int32_t CallFunc_Array_Get_Item_2, int32_t CallFunc_Array_Length_ReturnValue_2, bool CallFunc_Less_IntInt_ReturnValue_2, int32_t CallFunc_Array_Get_Item_3, int32_t CallFunc_Array_Length_ReturnValue_3, bool CallFunc_Less_IntInt_ReturnValue_3, int32_t CallFunc_Array_Get_Item_4, int32_t CallFunc_Array_Length_ReturnValue_4, bool CallFunc_Less_IntInt_ReturnValue_4, bool CallFunc_Greater_IntInt_ReturnValue_2, bool CallFunc_Greater_IntInt_ReturnValue_3, bool CallFunc_Greater_IntInt_ReturnValue_4, int32_t CallFunc_Array_Get_Item_5, int32_t CallFunc_Array_Length_ReturnValue_5, bool CallFunc_Less_IntInt_ReturnValue_5, bool CallFunc_Greater_IntInt_ReturnValue_5);
    void Show_Location_Tags(USplineComponent* Spline, int32_t Last_Index, float Section_Length, FTransform Temp_struct_Variable, int32_t Temp_int_Variable);
    void Relocate_Spline(USplineComponent* Spline, FVector CallFunc_K2_GetComponentLocation_ReturnValue, FHitResult CallFunc_K2_SetWorldLocation_SweepHitResult);
    void Re_Order_Meshes();
}; // Size: 0x3e0
#pragma pack(pop)
