#pragma once
#include <cstdint>
#include "AActor.hpp"
class UPhysicalResponseComponent;
class UStaticMeshComponent;
class USceneComponent;
#pragma pack(push, 1)
class ABP_Sanc_TerrariumForestStart_Dwiz_Dressing01_C : public AActor {
public:
    UPhysicalResponseComponent* PhysicalResponse69; // 0x248
    UPhysicalResponseComponent* PhysicalResponse68; // 0x250
    UPhysicalResponseComponent* PhysicalResponse67; // 0x258
    UPhysicalResponseComponent* PhysicalResponse73; // 0x260
    UPhysicalResponseComponent* PhysicalResponse74; // 0x268
    UPhysicalResponseComponent* PhysicalResponse65; // 0x270
    UPhysicalResponseComponent* PhysicalResponse64; // 0x278
    UPhysicalResponseComponent* PhysicalResponse63; // 0x280
    UPhysicalResponseComponent* PhysicalResponse66; // 0x288
    UPhysicalResponseComponent* PhysicalResponse75; // 0x290
    UStaticMeshComponent* SM_HW_L_New_Book_A5; // 0x298
    UStaticMeshComponent* SM_HM_Quill_Rolled_Parchment_Pile_A1; // 0x2a0
    UStaticMeshComponent* SM_HM_3Broom_Jug_C1; // 0x2a8
    UStaticMeshComponent* StaticMeshComponent027; // 0x2b0
    UStaticMeshComponent* SM_Sanc_L_BookRow_Half_D3; // 0x2b8
    UStaticMeshComponent* StaticMeshComponent047; // 0x2c0
    UStaticMeshComponent* StaticMeshComponent033; // 0x2c8
    UStaticMeshComponent* StaticMeshComponent032; // 0x2d0
    UStaticMeshComponent* SM_Sanc_GlassContainer_Dwiz_01A1; // 0x2d8
    UStaticMeshComponent* SM_Sanc_Candle_Dwiz_01A2; // 0x2e0
    USceneComponent* SceneRoot; // 0x2e8
    static ABP_Sanc_TerrariumForestStart_Dwiz_Dressing01_C* StaticClass();
}; // Size: 0x2f0
#pragma pack(pop)
