#pragma once
#include <cstdint>
#include "AActor.hpp"
class UPhysicalResponseComponent;
class UStaticMeshComponent;
class USceneComponent;
#pragma pack(push, 1)
class ABP_Sanc_TerrariumForestStart_Dwiz_Dressing04_C : public AActor {
public:
    UPhysicalResponseComponent* PhysicalResponse88; // 0x248
    UPhysicalResponseComponent* PhysicalResponse10; // 0x250
    UPhysicalResponseComponent* PhysicalResponse101; // 0x258
    UPhysicalResponseComponent* PhysicalResponse9; // 0x260
    UPhysicalResponseComponent* PhysicalResponse96; // 0x268
    UPhysicalResponseComponent* PhysicalResponse94; // 0x270
    UStaticMeshComponent* SM_HW_L_New_Book_F3; // 0x278
    UStaticMeshComponent* SM_Sanc_L_BookRow_Half_D5; // 0x280
    UStaticMeshComponent* StaticMeshComponent046; // 0x288
    UPhysicalResponseComponent* PhysicalResponse100; // 0x290
    UStaticMeshComponent* StaticMeshComponent059; // 0x298
    UStaticMeshComponent* StaticMeshComponent058; // 0x2a0
    UStaticMeshComponent* StaticMeshComponent057; // 0x2a8
    UStaticMeshComponent* SM_HW_DAO_CreepyFrame_A; // 0x2b0
    UStaticMeshComponent* SM_HW_L_New_Book_A3; // 0x2b8
    UStaticMeshComponent* SM_HW_HourGlass_D3; // 0x2c0
    USceneComponent* SceneRoot; // 0x2c8
    static ABP_Sanc_TerrariumForestStart_Dwiz_Dressing04_C* StaticClass();
}; // Size: 0x2d0
#pragma pack(pop)
