#pragma once
#include <cstdint>
#include "AActor.hpp"
class UPhysicalResponseComponent;
class UStaticMeshComponent;
class USceneComponent;
#pragma pack(push, 1)
class ABP_Sanc_TerrariumForestStart_Dwiz_Dressing03_C : public AActor {
public:
    UPhysicalResponseComponent* PhysicalResponse95; // 0x248
    UPhysicalResponseComponent* PhysicalResponse99; // 0x250
    UPhysicalResponseComponent* PhysicalResponse98; // 0x258
    UPhysicalResponseComponent* PhysicalResponse97; // 0x260
    UPhysicalResponseComponent* PhysicalResponse89; // 0x268
    UPhysicalResponseComponent* PhysicalResponse90; // 0x270
    UPhysicalResponseComponent* PhysicalResponse91; // 0x278
    UPhysicalResponseComponent* PhysicalResponse92; // 0x280
    UPhysicalResponseComponent* PhysicalResponse93; // 0x288
    UStaticMeshComponent* SM_Sanc_L_BookRow_Half_D4; // 0x290
    UStaticMeshComponent* SM_HM_Quill_Rolled_Parchment_Pile_A3; // 0x298
    UStaticMeshComponent* StaticMeshComponent048; // 0x2a0
    UStaticMeshComponent* SM_HW_L_New_Book_A6; // 0x2a8
    UStaticMeshComponent* SM_Sanc_Candle_Dwiz_01A3; // 0x2b0
    UStaticMeshComponent* StaticMeshComponent034; // 0x2b8
    UStaticMeshComponent* StaticMeshComponent028; // 0x2c0
    UStaticMeshComponent* StaticMeshComponent035; // 0x2c8
    UStaticMeshComponent* SM_Sanc_GlassContainer_Dwiz_01A2; // 0x2d0
    USceneComponent* SceneRoot; // 0x2d8
    static ABP_Sanc_TerrariumForestStart_Dwiz_Dressing03_C* StaticClass();
}; // Size: 0x2e0
#pragma pack(pop)
