#pragma once
#include <cstdint>
#include "AActor.hpp"
class UStaticMeshComponent;
class USceneComponent;
#pragma pack(push, 1)
class ABP_Sanc_HubCornerBookshelfs_03_Dwiz_Dressing02_C : public AActor {
public:
    UStaticMeshComponent* SM_HM_Quidditch_TrophyE1; // 0x248
    UStaticMeshComponent* SM_Sanc_Jar_Dwiz_01A7; // 0x250
    UStaticMeshComponent* SM_HM_Quidditch_TrophyE; // 0x258
    UStaticMeshComponent* SM_Sanc_Candle_Dwiz_01A; // 0x260
    UStaticMeshComponent* StaticMeshComponent047; // 0x268
    UStaticMeshComponent* StaticMeshComponent035; // 0x270
    UStaticMeshComponent* SM_Sanc_Jar_Dwiz_01A5; // 0x278
    UStaticMeshComponent* SM_HW_L_New_Book_A13; // 0x280
    UStaticMeshComponent* StaticMeshComponent034; // 0x288
    UStaticMeshComponent* StaticMeshComponent033; // 0x290
    UStaticMeshComponent* SM_HW_L_New_Book_A5; // 0x298
    UStaticMeshComponent* SM_Sanc_Curtains_02_Dwiz4; // 0x2a0
    UStaticMeshComponent* SM_Sanc_ColumnSmall_01_Dwiz2; // 0x2a8
    UStaticMeshComponent* SM_HW_L_New_Book_A2; // 0x2b0
    USceneComponent* SceneRoot; // 0x2b8
    static ABP_Sanc_HubCornerBookshelfs_03_Dwiz_Dressing02_C* StaticClass();
}; // Size: 0x2c0
#pragma pack(pop)
