#pragma once
#include <cstdint>
#pragma pack(push, 1)
struct FMercunaNavUsageTypes {
    uint8_t bUsageType0 : 1; // 0x0
    uint8_t bUsageType1 : 1; // 0x0
    uint8_t bUsageType2 : 1; // 0x0
    uint8_t bUsageType3 : 1; // 0x0
    uint8_t bUsageType4 : 1; // 0x0
    uint8_t bUsageType5 : 1; // 0x0
    uint8_t bUsageType6 : 1; // 0x0
    uint8_t bUsageType7 : 1; // 0x0
    uint8_t bUsageType8 : 1; // 0x1
    uint8_t bUsageType9 : 1; // 0x1
    uint8_t bUsageType10 : 1; // 0x1
    uint8_t bUsageType11 : 1; // 0x1
    uint8_t bUsageType12 : 1; // 0x1
    uint8_t bUsageType13 : 1; // 0x1
    uint8_t bUsageType14 : 1; // 0x1
    uint8_t bUsageType15 : 1; // 0x1
    uint8_t bUsageType16 : 1; // 0x2
    uint8_t bUsageType17 : 1; // 0x2
    uint8_t bUsageType18 : 1; // 0x2
    uint8_t bUsageType19 : 1; // 0x2
    uint8_t bUsageType20 : 1; // 0x2
    uint8_t bUsageType21 : 1; // 0x2
    uint8_t bUsageType22 : 1; // 0x2
    uint8_t bUsageType23 : 1; // 0x2
    uint8_t bUsageType24 : 1; // 0x3
    uint8_t bUsageType25 : 1; // 0x3
    uint8_t bUsageType26 : 1; // 0x3
    uint8_t bUsageType27 : 1; // 0x3
    uint8_t bUsageType28 : 1; // 0x3
    uint8_t bUsageType29 : 1; // 0x3
    uint8_t bUsageType30 : 1; // 0x3
    uint8_t bUsageType31 : 1; // 0x3
}; // Size: 0x4
#pragma pack(pop)
