#pragma once
#include <cstdint>
#pragma pack(push, 1)
struct FNavAvoidanceMask {
    uint8_t bGroup0 : 1; // 0x0
    uint8_t bGroup1 : 1; // 0x0
    uint8_t bGroup2 : 1; // 0x0
    uint8_t bGroup3 : 1; // 0x0
    uint8_t bGroup4 : 1; // 0x0
    uint8_t bGroup5 : 1; // 0x0
    uint8_t bGroup6 : 1; // 0x0
    uint8_t bGroup7 : 1; // 0x0
    uint8_t bGroup8 : 1; // 0x1
    uint8_t bGroup9 : 1; // 0x1
    uint8_t bGroup10 : 1; // 0x1
    uint8_t bGroup11 : 1; // 0x1
    uint8_t bGroup12 : 1; // 0x1
    uint8_t bGroup13 : 1; // 0x1
    uint8_t bGroup14 : 1; // 0x1
    uint8_t bGroup15 : 1; // 0x1
    uint8_t bGroup16 : 1; // 0x2
    uint8_t bGroup17 : 1; // 0x2
    uint8_t bGroup18 : 1; // 0x2
    uint8_t bGroup19 : 1; // 0x2
    uint8_t bGroup20 : 1; // 0x2
    uint8_t bGroup21 : 1; // 0x2
    uint8_t bGroup22 : 1; // 0x2
    uint8_t bGroup23 : 1; // 0x2
    uint8_t bGroup24 : 1; // 0x3
    uint8_t bGroup25 : 1; // 0x3
    uint8_t bGroup26 : 1; // 0x3
    uint8_t bGroup27 : 1; // 0x3
    uint8_t bGroup28 : 1; // 0x3
    uint8_t bGroup29 : 1; // 0x3
    uint8_t bGroup30 : 1; // 0x3
    uint8_t bGroup31 : 1; // 0x3
}; // Size: 0x4
#pragma pack(pop)
