#pragma once
#include <cstdint>
#pragma pack(push, 1)
struct FPropList {
    TArray<void*> Overland_27_B7F9AC9246BB6E856A027BBE3E8575A4; // 0x0
    TArray<void*> Castle_28_2DAEE6544C5EF23EDE4B259D0BCE8E54; // 0x10
    TArray<void*> Cairn_29_E246348546B3B0AF3C2AD188EEA8842A; // 0x20
    TArray<void*> Sanctum_30_B8DAE5F142ED2E848E5E298C51CF3E19; // 0x30
    TArray<void*> Cavern_31_263216FD46CA581952F06BAECDA08C50; // 0x40
    TArray<void*> Hogwarts_35_025A5976434426E65D385E86CD0BAB2E; // 0x50
    TArray<void*> Hogsmeade_37_F39CEEF349C3D302B0862A96C834808E; // 0x60
    TArray<void*> Hamlets_41_6EF051194DF8473A795DD68BCE011415; // 0x70
    TArray<void*> Bandit_43_906252484568999F97A05EB78BB003F9; // 0x80
    TArray<void*> GobMines_47_6DF174C846923FEA52047CB2D24A2563; // 0x90
    TArray<void*> Cages_54_B10C51D542193FA5393557BE03E6FE14; // 0xa0
}; // Size: 0xb0
#pragma pack(pop)
