#pragma once
#include <cstdint>
#pragma pack(push, 1)
struct FSTR_LightFixtureDefaults {
    int32_t Index_62_3CF3F65D4F8B1CD3AE7A50B7CDC5AAB3; // 0x0
    float AttenuationRadius_PointLight_27_797C0EB44A3B265D8781AF84302736E4; // 0x4
    float Intensity_PointLight_28_3450B9964432A4581BFDC385F3CB7C5A; // 0x8
    float Temperature_PointLight_29_68A5997D445013A5637F82A1ECD15461; // 0xc
    float AttenuationRadius_SpotLight_37_098D974B4E3681829036678ACA632312; // 0x10
    float Intensity_SpotLight_40_8D8208794276DAF7F15CE9889579B9F9; // 0x14
    float Temperature_SpotLight_42_931D11784C141E4439B9989E03BF9E3E; // 0x18
    float SourceRadius_PointLight_69_F4BA62CB4874360BE1DAC48A923719E4; // 0x1c
    float SourceRadius_SpotLight_71_AF85A8D24C5A7BA3B7AA2687A7650AE2; // 0x20
}; // Size: 0x24
#pragma pack(pop)
