#include "FAnimNode_Root.hpp"
#include "FAnimNode_SequencePlayer.hpp"
#include "FAnimNode_StateMachine.hpp"
#include "FAnimNode_StateResult.hpp"
#include "FAnimNode_TransitionResult.hpp"
#include "FPointerToUberGraphFrame.hpp"
#include "FPoseLink.hpp"
#include "UABP_Leech_C.hpp"
#include "UAnimInstance.hpp"
#include "UFunction.hpp"
void UABP_Leech_C::EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Leech_AnimGraphNode_TransitionResult_21EF95F4492FA9CEBE303E894ADE836F() {
    static auto func = (UFunction*)(find_uobject("Function /Game/RiggedObjects/Environments/Forageables/Leech/ABP_Leech.ABP_Leech_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Leech_AnimGraphNode_TransitionResult_21EF95F4492FA9CEBE303E894ADE836F"));
    struct Params_EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Leech_AnimGraphNode_TransitionResult_21EF95F4492FA9CEBE303E894ADE836F {
    }; // Size: 0x0
    Params_EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Leech_AnimGraphNode_TransitionResult_21EF95F4492FA9CEBE303E894ADE836F params{};
    ProcessEvent(func, &params);
}
void UABP_Leech_C::EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Leech_AnimGraphNode_TransitionResult_C4AE85B94C0DBF344A2426A8CF100644() {
    static auto func = (UFunction*)(find_uobject("Function /Game/RiggedObjects/Environments/Forageables/Leech/ABP_Leech.ABP_Leech_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Leech_AnimGraphNode_TransitionResult_C4AE85B94C0DBF344A2426A8CF100644"));
    struct Params_EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Leech_AnimGraphNode_TransitionResult_C4AE85B94C0DBF344A2426A8CF100644 {
    }; // Size: 0x0
    Params_EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Leech_AnimGraphNode_TransitionResult_C4AE85B94C0DBF344A2426A8CF100644 params{};
    ProcessEvent(func, &params);
}
UABP_Leech_C* UABP_Leech_C::StaticClass() {
    static auto res = find_uobject("AnimBlueprintGeneratedClass /Game/RiggedObjects/Environments/Forageables/Leech/ABP_Leech.ABP_Leech_C");
    return (UABP_Leech_C*)res;
}
void UABP_Leech_C::AnimGraph(FPoseLink& AnimGraph) {
    static auto func = (UFunction*)(find_uobject("Function /Game/RiggedObjects/Environments/Forageables/Leech/ABP_Leech.ABP_Leech_C.AnimGraph"));
    struct Params_AnimGraph {
        FPoseLink AnimGraph; // 0x0
    }; // Size: 0x10
    Params_AnimGraph params{};
    params.AnimGraph = (FPoseLink)AnimGraph;
    ProcessEvent(func, &params);
    AnimGraph = params.AnimGraph;
}
void UABP_Leech_C::EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Leech_AnimGraphNode_TransitionResult_8AA38AB1426D9F80C11E1A8C9717C9BA() {
    static auto func = (UFunction*)(find_uobject("Function /Game/RiggedObjects/Environments/Forageables/Leech/ABP_Leech.ABP_Leech_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Leech_AnimGraphNode_TransitionResult_8AA38AB1426D9F80C11E1A8C9717C9BA"));
    struct Params_EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Leech_AnimGraphNode_TransitionResult_8AA38AB1426D9F80C11E1A8C9717C9BA {
    }; // Size: 0x0
    Params_EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Leech_AnimGraphNode_TransitionResult_8AA38AB1426D9F80C11E1A8C9717C9BA params{};
    ProcessEvent(func, &params);
}
void UABP_Leech_C::EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Leech_AnimGraphNode_TransitionResult_F78B756F4CECC940CD6C578BD5693BC7() {
    static auto func = (UFunction*)(find_uobject("Function /Game/RiggedObjects/Environments/Forageables/Leech/ABP_Leech.ABP_Leech_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Leech_AnimGraphNode_TransitionResult_F78B756F4CECC940CD6C578BD5693BC7"));
    struct Params_EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Leech_AnimGraphNode_TransitionResult_F78B756F4CECC940CD6C578BD5693BC7 {
    }; // Size: 0x0
    Params_EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Leech_AnimGraphNode_TransitionResult_F78B756F4CECC940CD6C578BD5693BC7 params{};
    ProcessEvent(func, &params);
}
void UABP_Leech_C::EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Leech_AnimGraphNode_TransitionResult_40B1E5B4402EC3CA373C829D22A63040() {
    static auto func = (UFunction*)(find_uobject("Function /Game/RiggedObjects/Environments/Forageables/Leech/ABP_Leech.ABP_Leech_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Leech_AnimGraphNode_TransitionResult_40B1E5B4402EC3CA373C829D22A63040"));
    struct Params_EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Leech_AnimGraphNode_TransitionResult_40B1E5B4402EC3CA373C829D22A63040 {
    }; // Size: 0x0
    Params_EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Leech_AnimGraphNode_TransitionResult_40B1E5B4402EC3CA373C829D22A63040 params{};
    ProcessEvent(func, &params);
}
void UABP_Leech_C::EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Leech_AnimGraphNode_TransitionResult_94433BCC44F7847E64BB6F870D2C5685() {
    static auto func = (UFunction*)(find_uobject("Function /Game/RiggedObjects/Environments/Forageables/Leech/ABP_Leech.ABP_Leech_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Leech_AnimGraphNode_TransitionResult_94433BCC44F7847E64BB6F870D2C5685"));
    struct Params_EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Leech_AnimGraphNode_TransitionResult_94433BCC44F7847E64BB6F870D2C5685 {
    }; // Size: 0x0
    Params_EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Leech_AnimGraphNode_TransitionResult_94433BCC44F7847E64BB6F870D2C5685 params{};
    ProcessEvent(func, &params);
}
void UABP_Leech_C::EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Leech_AnimGraphNode_TransitionResult_54FCCD47485FED729DE1C5A8EB85DB7B() {
    static auto func = (UFunction*)(find_uobject("Function /Game/RiggedObjects/Environments/Forageables/Leech/ABP_Leech.ABP_Leech_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Leech_AnimGraphNode_TransitionResult_54FCCD47485FED729DE1C5A8EB85DB7B"));
    struct Params_EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Leech_AnimGraphNode_TransitionResult_54FCCD47485FED729DE1C5A8EB85DB7B {
    }; // Size: 0x0
    Params_EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Leech_AnimGraphNode_TransitionResult_54FCCD47485FED729DE1C5A8EB85DB7B params{};
    ProcessEvent(func, &params);
}
void UABP_Leech_C::EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Leech_AnimGraphNode_TransitionResult_0474C1DE48AB25B6D8AD25991EEA2430() {
    static auto func = (UFunction*)(find_uobject("Function /Game/RiggedObjects/Environments/Forageables/Leech/ABP_Leech.ABP_Leech_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Leech_AnimGraphNode_TransitionResult_0474C1DE48AB25B6D8AD25991EEA2430"));
    struct Params_EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Leech_AnimGraphNode_TransitionResult_0474C1DE48AB25B6D8AD25991EEA2430 {
    }; // Size: 0x0
    Params_EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Leech_AnimGraphNode_TransitionResult_0474C1DE48AB25B6D8AD25991EEA2430 params{};
    ProcessEvent(func, &params);
}
void UABP_Leech_C::EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Leech_AnimGraphNode_TransitionResult_B7408692479B0FC257B85BA74E79212F() {
    static auto func = (UFunction*)(find_uobject("Function /Game/RiggedObjects/Environments/Forageables/Leech/ABP_Leech.ABP_Leech_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Leech_AnimGraphNode_TransitionResult_B7408692479B0FC257B85BA74E79212F"));
    struct Params_EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Leech_AnimGraphNode_TransitionResult_B7408692479B0FC257B85BA74E79212F {
    }; // Size: 0x0
    Params_EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Leech_AnimGraphNode_TransitionResult_B7408692479B0FC257B85BA74E79212F params{};
    ProcessEvent(func, &params);
}
void UABP_Leech_C::EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Leech_AnimGraphNode_TransitionResult_AAE22BC04C01D9C195C0B387C7D7999F() {
    static auto func = (UFunction*)(find_uobject("Function /Game/RiggedObjects/Environments/Forageables/Leech/ABP_Leech.ABP_Leech_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Leech_AnimGraphNode_TransitionResult_AAE22BC04C01D9C195C0B387C7D7999F"));
    struct Params_EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Leech_AnimGraphNode_TransitionResult_AAE22BC04C01D9C195C0B387C7D7999F {
    }; // Size: 0x0
    Params_EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Leech_AnimGraphNode_TransitionResult_AAE22BC04C01D9C195C0B387C7D7999F params{};
    ProcessEvent(func, &params);
}
void UABP_Leech_C::EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Leech_AnimGraphNode_TransitionResult_C057706D4EB66F20EE6665817ED4AC73() {
    static auto func = (UFunction*)(find_uobject("Function /Game/RiggedObjects/Environments/Forageables/Leech/ABP_Leech.ABP_Leech_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Leech_AnimGraphNode_TransitionResult_C057706D4EB66F20EE6665817ED4AC73"));
    struct Params_EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Leech_AnimGraphNode_TransitionResult_C057706D4EB66F20EE6665817ED4AC73 {
    }; // Size: 0x0
    Params_EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Leech_AnimGraphNode_TransitionResult_C057706D4EB66F20EE6665817ED4AC73 params{};
    ProcessEvent(func, &params);
}
void UABP_Leech_C::EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Leech_AnimGraphNode_TransitionResult_5A7DE19E4E708ED68927A7BBCE79CC9F() {
    static auto func = (UFunction*)(find_uobject("Function /Game/RiggedObjects/Environments/Forageables/Leech/ABP_Leech.ABP_Leech_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Leech_AnimGraphNode_TransitionResult_5A7DE19E4E708ED68927A7BBCE79CC9F"));
    struct Params_EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Leech_AnimGraphNode_TransitionResult_5A7DE19E4E708ED68927A7BBCE79CC9F {
    }; // Size: 0x0
    Params_EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Leech_AnimGraphNode_TransitionResult_5A7DE19E4E708ED68927A7BBCE79CC9F params{};
    ProcessEvent(func, &params);
}
void UABP_Leech_C::BlueprintUpdateAnimation0(float DeltaTimeX) {
    static auto func = (UFunction*)(find_uobject("Function /Game/RiggedObjects/Environments/Forageables/Leech/ABP_Leech.ABP_Leech_C.BlueprintUpdateAnimation"));
    struct Params_BlueprintUpdateAnimation {
        float DeltaTimeX; // 0x0
    }; // Size: 0x4
    Params_BlueprintUpdateAnimation params{};
    params.DeltaTimeX = (float)DeltaTimeX;
    ProcessEvent(func, &params);
}
void UABP_Leech_C::ResetFromCollectEvent() {
    static auto func = (UFunction*)(find_uobject("Function /Game/RiggedObjects/Environments/Forageables/Leech/ABP_Leech.ABP_Leech_C.ResetFromCollectEvent"));
    struct Params_ResetFromCollectEvent {
    }; // Size: 0x0
    Params_ResetFromCollectEvent params{};
    ProcessEvent(func, &params);
}
void UABP_Leech_C::ExecuteUbergraph_ABP_Leech(int32_t EntryPoint, float CallFunc_GetRelevantAnimTimeRemainingFraction_ReturnValue, float CallFunc_GetRelevantAnimTimeRemainingFraction_ReturnValue_1, bool CallFunc_EqualEqual_FloatFloat_ReturnValue, bool CallFunc_EqualEqual_FloatFloat_ReturnValue_1, bool CallFunc_BooleanOR_ReturnValue, bool CallFunc_BooleanOR_ReturnValue_1, float CallFunc_GetRelevantAnimTimeRemainingFraction_ReturnValue_2, bool CallFunc_EqualEqual_FloatFloat_ReturnValue_2, float CallFunc_GetRelevantAnimTimeRemainingFraction_ReturnValue_3, bool CallFunc_BooleanOR_ReturnValue_2, bool CallFunc_EqualEqual_FloatFloat_ReturnValue_3, float CallFunc_GetRelevantAnimTimeRemainingFraction_ReturnValue_4, bool CallFunc_BooleanOR_ReturnValue_3, bool CallFunc_EqualEqual_FloatFloat_ReturnValue_4, float CallFunc_GetRelevantAnimTimeRemainingFraction_ReturnValue_5, bool CallFunc_BooleanOR_ReturnValue_4, bool CallFunc_EqualEqual_FloatFloat_ReturnValue_5, bool CallFunc_BooleanOR_ReturnValue_5, bool CallFunc_EqualEqual_IntInt_ReturnValue, bool CallFunc_BooleanAND_ReturnValue, bool CallFunc_EqualEqual_IntInt_ReturnValue_1, bool CallFunc_BooleanAND_ReturnValue_1, bool CallFunc_EqualEqual_IntInt_ReturnValue_2, bool CallFunc_BooleanAND_ReturnValue_2, bool CallFunc_EqualEqual_IntInt_ReturnValue_3, bool CallFunc_BooleanAND_ReturnValue_3, bool CallFunc_EqualEqual_IntInt_ReturnValue_4, bool CallFunc_BooleanAND_ReturnValue_4, bool CallFunc_EqualEqual_IntInt_ReturnValue_5, bool CallFunc_BooleanAND_ReturnValue_5, float K2Node_Event_DeltaTimeX, float CallFunc_GetTimeSeconds_ReturnValue, float CallFunc_Subtract_FloatFloat_ReturnValue, int32_t CallFunc_RandomIntegerInRange_ReturnValue, bool CallFunc_GreaterEqual_FloatFloat_ReturnValue, float CallFunc_GetTimeSeconds_ReturnValue_1, float CallFunc_RandomFloatInRange_ReturnValue) {
    static auto func = (UFunction*)(find_uobject("Function /Game/RiggedObjects/Environments/Forageables/Leech/ABP_Leech.ABP_Leech_C.ExecuteUbergraph_ABP_Leech"));
    struct Params_ExecuteUbergraph_ABP_Leech {
        int32_t EntryPoint; // 0x0
        float CallFunc_GetRelevantAnimTimeRemainingFraction_ReturnValue; // 0x4
        float CallFunc_GetRelevantAnimTimeRemainingFraction_ReturnValue_1; // 0x8
        bool CallFunc_EqualEqual_FloatFloat_ReturnValue; // 0xc
        bool CallFunc_EqualEqual_FloatFloat_ReturnValue_1; // 0xd
        bool CallFunc_BooleanOR_ReturnValue; // 0xe
        bool CallFunc_BooleanOR_ReturnValue_1; // 0xf
        float CallFunc_GetRelevantAnimTimeRemainingFraction_ReturnValue_2; // 0x10
        bool CallFunc_EqualEqual_FloatFloat_ReturnValue_2; // 0x14
        char pad_15[0x3];
        float CallFunc_GetRelevantAnimTimeRemainingFraction_ReturnValue_3; // 0x18
        bool CallFunc_BooleanOR_ReturnValue_2; // 0x1c
        bool CallFunc_EqualEqual_FloatFloat_ReturnValue_3; // 0x1d
        char pad_1e[0x2];
        float CallFunc_GetRelevantAnimTimeRemainingFraction_ReturnValue_4; // 0x20
        bool CallFunc_BooleanOR_ReturnValue_3; // 0x24
        bool CallFunc_EqualEqual_FloatFloat_ReturnValue_4; // 0x25
        char pad_26[0x2];
        float CallFunc_GetRelevantAnimTimeRemainingFraction_ReturnValue_5; // 0x28
        bool CallFunc_BooleanOR_ReturnValue_4; // 0x2c
        bool CallFunc_EqualEqual_FloatFloat_ReturnValue_5; // 0x2d
        bool CallFunc_BooleanOR_ReturnValue_5; // 0x2e
        bool CallFunc_EqualEqual_IntInt_ReturnValue; // 0x2f
        bool CallFunc_BooleanAND_ReturnValue; // 0x30
        bool CallFunc_EqualEqual_IntInt_ReturnValue_1; // 0x31
        bool CallFunc_BooleanAND_ReturnValue_1; // 0x32
        bool CallFunc_EqualEqual_IntInt_ReturnValue_2; // 0x33
        bool CallFunc_BooleanAND_ReturnValue_2; // 0x34
        bool CallFunc_EqualEqual_IntInt_ReturnValue_3; // 0x35
        bool CallFunc_BooleanAND_ReturnValue_3; // 0x36
        bool CallFunc_EqualEqual_IntInt_ReturnValue_4; // 0x37
        bool CallFunc_BooleanAND_ReturnValue_4; // 0x38
        bool CallFunc_EqualEqual_IntInt_ReturnValue_5; // 0x39
        bool CallFunc_BooleanAND_ReturnValue_5; // 0x3a
        char pad_3b[0x1];
        float K2Node_Event_DeltaTimeX; // 0x3c
        float CallFunc_GetTimeSeconds_ReturnValue; // 0x40
        float CallFunc_Subtract_FloatFloat_ReturnValue; // 0x44
        int32_t CallFunc_RandomIntegerInRange_ReturnValue; // 0x48
        bool CallFunc_GreaterEqual_FloatFloat_ReturnValue; // 0x4c
        char pad_4d[0x3];
        float CallFunc_GetTimeSeconds_ReturnValue_1; // 0x50
        float CallFunc_RandomFloatInRange_ReturnValue; // 0x54
    }; // Size: 0x58
    Params_ExecuteUbergraph_ABP_Leech params{};
    params.EntryPoint = (int32_t)EntryPoint;
    params.CallFunc_GetRelevantAnimTimeRemainingFraction_ReturnValue = (float)CallFunc_GetRelevantAnimTimeRemainingFraction_ReturnValue;
    params.CallFunc_GetRelevantAnimTimeRemainingFraction_ReturnValue_1 = (float)CallFunc_GetRelevantAnimTimeRemainingFraction_ReturnValue_1;
    params.CallFunc_EqualEqual_FloatFloat_ReturnValue = (bool)CallFunc_EqualEqual_FloatFloat_ReturnValue;
    params.CallFunc_EqualEqual_FloatFloat_ReturnValue_1 = (bool)CallFunc_EqualEqual_FloatFloat_ReturnValue_1;
    params.CallFunc_BooleanOR_ReturnValue = (bool)CallFunc_BooleanOR_ReturnValue;
    params.CallFunc_BooleanOR_ReturnValue_1 = (bool)CallFunc_BooleanOR_ReturnValue_1;
    params.CallFunc_GetRelevantAnimTimeRemainingFraction_ReturnValue_2 = (float)CallFunc_GetRelevantAnimTimeRemainingFraction_ReturnValue_2;
    params.CallFunc_EqualEqual_FloatFloat_ReturnValue_2 = (bool)CallFunc_EqualEqual_FloatFloat_ReturnValue_2;
    params.CallFunc_GetRelevantAnimTimeRemainingFraction_ReturnValue_3 = (float)CallFunc_GetRelevantAnimTimeRemainingFraction_ReturnValue_3;
    params.CallFunc_BooleanOR_ReturnValue_2 = (bool)CallFunc_BooleanOR_ReturnValue_2;
    params.CallFunc_EqualEqual_FloatFloat_ReturnValue_3 = (bool)CallFunc_EqualEqual_FloatFloat_ReturnValue_3;
    params.CallFunc_GetRelevantAnimTimeRemainingFraction_ReturnValue_4 = (float)CallFunc_GetRelevantAnimTimeRemainingFraction_ReturnValue_4;
    params.CallFunc_BooleanOR_ReturnValue_3 = (bool)CallFunc_BooleanOR_ReturnValue_3;
    params.CallFunc_EqualEqual_FloatFloat_ReturnValue_4 = (bool)CallFunc_EqualEqual_FloatFloat_ReturnValue_4;
    params.CallFunc_GetRelevantAnimTimeRemainingFraction_ReturnValue_5 = (float)CallFunc_GetRelevantAnimTimeRemainingFraction_ReturnValue_5;
    params.CallFunc_BooleanOR_ReturnValue_4 = (bool)CallFunc_BooleanOR_ReturnValue_4;
    params.CallFunc_EqualEqual_FloatFloat_ReturnValue_5 = (bool)CallFunc_EqualEqual_FloatFloat_ReturnValue_5;
    params.CallFunc_BooleanOR_ReturnValue_5 = (bool)CallFunc_BooleanOR_ReturnValue_5;
    params.CallFunc_EqualEqual_IntInt_ReturnValue = (bool)CallFunc_EqualEqual_IntInt_ReturnValue;
    params.CallFunc_BooleanAND_ReturnValue = (bool)CallFunc_BooleanAND_ReturnValue;
    params.CallFunc_EqualEqual_IntInt_ReturnValue_1 = (bool)CallFunc_EqualEqual_IntInt_ReturnValue_1;
    params.CallFunc_BooleanAND_ReturnValue_1 = (bool)CallFunc_BooleanAND_ReturnValue_1;
    params.CallFunc_EqualEqual_IntInt_ReturnValue_2 = (bool)CallFunc_EqualEqual_IntInt_ReturnValue_2;
    params.CallFunc_BooleanAND_ReturnValue_2 = (bool)CallFunc_BooleanAND_ReturnValue_2;
    params.CallFunc_EqualEqual_IntInt_ReturnValue_3 = (bool)CallFunc_EqualEqual_IntInt_ReturnValue_3;
    params.CallFunc_BooleanAND_ReturnValue_3 = (bool)CallFunc_BooleanAND_ReturnValue_3;
    params.CallFunc_EqualEqual_IntInt_ReturnValue_4 = (bool)CallFunc_EqualEqual_IntInt_ReturnValue_4;
    params.CallFunc_BooleanAND_ReturnValue_4 = (bool)CallFunc_BooleanAND_ReturnValue_4;
    params.CallFunc_EqualEqual_IntInt_ReturnValue_5 = (bool)CallFunc_EqualEqual_IntInt_ReturnValue_5;
    params.CallFunc_BooleanAND_ReturnValue_5 = (bool)CallFunc_BooleanAND_ReturnValue_5;
    params.K2Node_Event_DeltaTimeX = (float)K2Node_Event_DeltaTimeX;
    params.CallFunc_GetTimeSeconds_ReturnValue = (float)CallFunc_GetTimeSeconds_ReturnValue;
    params.CallFunc_Subtract_FloatFloat_ReturnValue = (float)CallFunc_Subtract_FloatFloat_ReturnValue;
    params.CallFunc_RandomIntegerInRange_ReturnValue = (int32_t)CallFunc_RandomIntegerInRange_ReturnValue;
    params.CallFunc_GreaterEqual_FloatFloat_ReturnValue = (bool)CallFunc_GreaterEqual_FloatFloat_ReturnValue;
    params.CallFunc_GetTimeSeconds_ReturnValue_1 = (float)CallFunc_GetTimeSeconds_ReturnValue_1;
    params.CallFunc_RandomFloatInRange_ReturnValue = (float)CallFunc_RandomFloatInRange_ReturnValue;
    ProcessEvent(func, &params);
}
