#include "FAnimNode_Root.hpp"
#include "FAnimNode_SequencePlayer.hpp"
#include "FAnimNode_StateMachine.hpp"
#include "FAnimNode_StateResult.hpp"
#include "FAnimNode_TransitionResult.hpp"
#include "FPointerToUberGraphFrame.hpp"
#include "FPoseLink.hpp"
#include "UABP_MapHelp_C.hpp"
#include "UAnimInstance.hpp"
#include "UFunction.hpp"
void UABP_MapHelp_C::EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_MapHelp_AnimGraphNode_TransitionResult_1529A0824F81BD24F1BEB7A0EACC8AAF() {
    static auto func = (UFunction*)(find_uobject("Function /Game/Gameplay/ToolSet/Items/InventoryItems/DEV_MapTool/ABP_MapHelp.ABP_MapHelp_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_MapHelp_AnimGraphNode_TransitionResult_1529A0824F81BD24F1BEB7A0EACC8AAF"));
    struct Params_EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_MapHelp_AnimGraphNode_TransitionResult_1529A0824F81BD24F1BEB7A0EACC8AAF {
    }; // Size: 0x0
    Params_EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_MapHelp_AnimGraphNode_TransitionResult_1529A0824F81BD24F1BEB7A0EACC8AAF params{};
    ProcessEvent(func, &params);
}
UABP_MapHelp_C* UABP_MapHelp_C::StaticClass() {
    static auto res = find_uobject("AnimBlueprintGeneratedClass /Game/Gameplay/ToolSet/Items/InventoryItems/DEV_MapTool/ABP_MapHelp.ABP_MapHelp_C");
    return (UABP_MapHelp_C*)res;
}
void UABP_MapHelp_C::AnimGraph(FPoseLink& AnimGraph) {
    static auto func = (UFunction*)(find_uobject("Function /Game/Gameplay/ToolSet/Items/InventoryItems/DEV_MapTool/ABP_MapHelp.ABP_MapHelp_C.AnimGraph"));
    struct Params_AnimGraph {
        FPoseLink AnimGraph; // 0x0
    }; // Size: 0x10
    Params_AnimGraph params{};
    params.AnimGraph = (FPoseLink)AnimGraph;
    ProcessEvent(func, &params);
    AnimGraph = params.AnimGraph;
}
void UABP_MapHelp_C::EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_MapHelp_AnimGraphNode_TransitionResult_0743C530449AA96914EF558D57AAC911() {
    static auto func = (UFunction*)(find_uobject("Function /Game/Gameplay/ToolSet/Items/InventoryItems/DEV_MapTool/ABP_MapHelp.ABP_MapHelp_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_MapHelp_AnimGraphNode_TransitionResult_0743C530449AA96914EF558D57AAC911"));
    struct Params_EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_MapHelp_AnimGraphNode_TransitionResult_0743C530449AA96914EF558D57AAC911 {
    }; // Size: 0x0
    Params_EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_MapHelp_AnimGraphNode_TransitionResult_0743C530449AA96914EF558D57AAC911 params{};
    ProcessEvent(func, &params);
}
void UABP_MapHelp_C::EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_MapHelp_AnimGraphNode_TransitionResult_AB6D13DD44D4C0A6E17BD296C87780E0() {
    static auto func = (UFunction*)(find_uobject("Function /Game/Gameplay/ToolSet/Items/InventoryItems/DEV_MapTool/ABP_MapHelp.ABP_MapHelp_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_MapHelp_AnimGraphNode_TransitionResult_AB6D13DD44D4C0A6E17BD296C87780E0"));
    struct Params_EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_MapHelp_AnimGraphNode_TransitionResult_AB6D13DD44D4C0A6E17BD296C87780E0 {
    }; // Size: 0x0
    Params_EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_MapHelp_AnimGraphNode_TransitionResult_AB6D13DD44D4C0A6E17BD296C87780E0 params{};
    ProcessEvent(func, &params);
}
void UABP_MapHelp_C::EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_MapHelp_AnimGraphNode_TransitionResult_B70D79314F1B87A09EA11F86B98175BE() {
    static auto func = (UFunction*)(find_uobject("Function /Game/Gameplay/ToolSet/Items/InventoryItems/DEV_MapTool/ABP_MapHelp.ABP_MapHelp_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_MapHelp_AnimGraphNode_TransitionResult_B70D79314F1B87A09EA11F86B98175BE"));
    struct Params_EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_MapHelp_AnimGraphNode_TransitionResult_B70D79314F1B87A09EA11F86B98175BE {
    }; // Size: 0x0
    Params_EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_MapHelp_AnimGraphNode_TransitionResult_B70D79314F1B87A09EA11F86B98175BE params{};
    ProcessEvent(func, &params);
}
void UABP_MapHelp_C::AnimNotify_OpenStarted() {
    static auto func = (UFunction*)(find_uobject("Function /Game/Gameplay/ToolSet/Items/InventoryItems/DEV_MapTool/ABP_MapHelp.ABP_MapHelp_C.AnimNotify_OpenStarted"));
    struct Params_AnimNotify_OpenStarted {
    }; // Size: 0x0
    Params_AnimNotify_OpenStarted params{};
    ProcessEvent(func, &params);
}
void UABP_MapHelp_C::AnimNotify_ReceiveStarted() {
    static auto func = (UFunction*)(find_uobject("Function /Game/Gameplay/ToolSet/Items/InventoryItems/DEV_MapTool/ABP_MapHelp.ABP_MapHelp_C.AnimNotify_ReceiveStarted"));
    struct Params_AnimNotify_ReceiveStarted {
    }; // Size: 0x0
    Params_AnimNotify_ReceiveStarted params{};
    ProcessEvent(func, &params);
}
void UABP_MapHelp_C::SetCatchPage() {
    static auto func = (UFunction*)(find_uobject("Function /Game/Gameplay/ToolSet/Items/InventoryItems/DEV_MapTool/ABP_MapHelp.ABP_MapHelp_C.SetCatchPage"));
    struct Params_SetCatchPage {
    }; // Size: 0x0
    Params_SetCatchPage params{};
    ProcessEvent(func, &params);
}
void UABP_MapHelp_C::AnimNotify_Catch_Entered() {
    static auto func = (UFunction*)(find_uobject("Function /Game/Gameplay/ToolSet/Items/InventoryItems/DEV_MapTool/ABP_MapHelp.ABP_MapHelp_C.AnimNotify_Catch_Entered"));
    struct Params_AnimNotify_Catch_Entered {
    }; // Size: 0x0
    Params_AnimNotify_Catch_Entered params{};
    ProcessEvent(func, &params);
}
void UABP_MapHelp_C::AnimNotify_Catch_Left() {
    static auto func = (UFunction*)(find_uobject("Function /Game/Gameplay/ToolSet/Items/InventoryItems/DEV_MapTool/ABP_MapHelp.ABP_MapHelp_C.AnimNotify_Catch_Left"));
    struct Params_AnimNotify_Catch_Left {
    }; // Size: 0x0
    Params_AnimNotify_Catch_Left params{};
    ProcessEvent(func, &params);
}
void UABP_MapHelp_C::AnimNotify_CatchAgain_Entered() {
    static auto func = (UFunction*)(find_uobject("Function /Game/Gameplay/ToolSet/Items/InventoryItems/DEV_MapTool/ABP_MapHelp.ABP_MapHelp_C.AnimNotify_CatchAgain_Entered"));
    struct Params_AnimNotify_CatchAgain_Entered {
    }; // Size: 0x0
    Params_AnimNotify_CatchAgain_Entered params{};
    ProcessEvent(func, &params);
}
void UABP_MapHelp_C::ExecuteUbergraph_ABP_MapHelp(int32_t EntryPoint, float CallFunc_GetRelevantAnimTimeRemaining_ReturnValue, float CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_1, bool CallFunc_LessEqual_FloatFloat_ReturnValue, bool CallFunc_LessEqual_FloatFloat_ReturnValue_1, float CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_2, float CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_3, bool CallFunc_LessEqual_FloatFloat_ReturnValue_2, bool CallFunc_LessEqual_FloatFloat_ReturnValue_3) {
    static auto func = (UFunction*)(find_uobject("Function /Game/Gameplay/ToolSet/Items/InventoryItems/DEV_MapTool/ABP_MapHelp.ABP_MapHelp_C.ExecuteUbergraph_ABP_MapHelp"));
    struct Params_ExecuteUbergraph_ABP_MapHelp {
        int32_t EntryPoint; // 0x0
        float CallFunc_GetRelevantAnimTimeRemaining_ReturnValue; // 0x4
        float CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_1; // 0x8
        bool CallFunc_LessEqual_FloatFloat_ReturnValue; // 0xc
        bool CallFunc_LessEqual_FloatFloat_ReturnValue_1; // 0xd
        char pad_e[0x2];
        float CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_2; // 0x10
        float CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_3; // 0x14
        bool CallFunc_LessEqual_FloatFloat_ReturnValue_2; // 0x18
        bool CallFunc_LessEqual_FloatFloat_ReturnValue_3; // 0x19
    }; // Size: 0x1a
    Params_ExecuteUbergraph_ABP_MapHelp params{};
    params.EntryPoint = (int32_t)EntryPoint;
    params.CallFunc_GetRelevantAnimTimeRemaining_ReturnValue = (float)CallFunc_GetRelevantAnimTimeRemaining_ReturnValue;
    params.CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_1 = (float)CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_1;
    params.CallFunc_LessEqual_FloatFloat_ReturnValue = (bool)CallFunc_LessEqual_FloatFloat_ReturnValue;
    params.CallFunc_LessEqual_FloatFloat_ReturnValue_1 = (bool)CallFunc_LessEqual_FloatFloat_ReturnValue_1;
    params.CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_2 = (float)CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_2;
    params.CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_3 = (float)CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_3;
    params.CallFunc_LessEqual_FloatFloat_ReturnValue_2 = (bool)CallFunc_LessEqual_FloatFloat_ReturnValue_2;
    params.CallFunc_LessEqual_FloatFloat_ReturnValue_3 = (bool)CallFunc_LessEqual_FloatFloat_ReturnValue_3;
    ProcessEvent(func, &params);
}
