#pragma once
#include <cstdint>
#include "EBTCustomActionType\Type.hpp"
#include "EInputDeviceUsed.hpp"
#include "EKnowledgeLevel.hpp"
#include "ELandingType\Type.hpp"
#include "EMovementMode.hpp"
#include "ESpeedModifierType\Type.hpp"
#include "EUIQActionBarType.hpp"
#include "FDamageInfo.hpp"
#include "FGameplayTagContainer.hpp"
#include "FPointerToUberGraphFrame.hpp"
#include "FRotator.hpp"
#include "FTimerHandle.hpp"
#include "FVariantMapHandle.hpp"
#include "FVector.hpp"
#include "UBTService_AvaAITree_Input.hpp"
class UUI_BP_GadgetWheel_C;
class UAblAbilityContext;
class APawn;
class UClass;
class AActor;
class ABiped_Player;
class AAmbulatory_Character;
class ABP_StealthTakedownInteractActor_C;
class AWandTool;
class APlayerController;
class UCombativePlantComponent;
class ABiped_PlayerController;
class AController;
class ASimpleInteractObject;
class AInventoryObject;
class UBlackboardComponent;
class ANPC_Character;
struct FMunitionImpactData;
class ULootDropComponent;
class AForagable;
class AHerb;
class UKnowledgeManager;
class UObject;
class UActorComponent;
class UCognitionStimuliSourceComponent;
class ACameraStackLookAtTargetActor;
class AWorldObject;
class UParticleSystemComponent;
class ACharacter;
class ABase_Character;
class UUIManager;
class UTutorialSystem;
class AHUD;
class APhoenixHUD;
class UUI_BP_PhoenixHUDWidget_C;
class UCreature_RiderComponent;
class UAnimInstance;
class UGameLogicObject;
class UCognitionComponent;
class UObjectStateInfo;
class UAmbulatory_AnimInstance;
class ATool;
struct FForcedConversation;
class AInventoryItemTool;
class ABiped_Character;
class UAISense;
struct FSurfaceTypeChanged;
#pragma pack(push, 1)
class UBTS_Biped_TopLevel_C : public UBTService_AvaAITree_Input {
public:
    FPointerToUberGraphFrame UberGraphFrame; // 0xf8
    FTimerHandle SprintTimerHandle; // 0x100
    bool TimeDilated; // 0x108
    char pad_109[0x7];
    UAblAbilityContext* AdditiveAbilityContext; // 0x110
    bool AnimDebugOn; // 0x118
    char pad_119[0x3];
    int32_t ReactionIndex; // 0x11c
    UClass* DebugReactionAbility; // 0x120
    int32_t SpellSlot; // 0x128
    EBTCustomActionType::Type BTActionType; // 0x12c
    char pad_12d[0x3];
    FTimerHandle LockOnTimerHandle; // 0x130
    FTimerHandle FullBodyWandCastTimerHandle; // 0x138
    FTimerHandle SpellButtonTimerHandle; // 0x140
    bool UsingInventoryItem; // 0x148
    char pad_149[0x7];
    AActor* InteractSenseTarget; // 0x150
    AActor* InteractActor; // 0x158
    FVariantMapHandle FullBodyCastVariantHandle; // 0x160
    bool StealthMode; // 0x164
    bool FinisherInitiated; // 0x165
    char pad_166[0x2];
    float DodgeCoolDownTime; // 0x168
    char pad_16c[0x4];
    FTimerHandle ProximityTimerHandle; // 0x170
    bool FaceShiftButtonHeld; // 0x178
    bool AltModifierPressed; // 0x179
    bool CogTargetDebugDraw; // 0x17a
    bool CancelQueuedStupefy; // 0x17b
    char pad_17c[0x4];
    FString CurrentHealthItem; // 0x180
    float TimeDeadBeforeDialog; // 0x190
    bool SoftLanding; // 0x194
    bool MedLanding; // 0x195
    bool FaceTarget; // 0x196
    bool IsMoving; // 0x197
    bool isSprinting; // 0x198
    ELandingType::Type LandingType; // 0x199
    char pad_19a[0x6];
    FTimerHandle ActivateActionsOnHUDTimerHandle; // 0x1a0
    bool HUDActionsShown; // 0x1a8
    bool MoveStickPressed; // 0x1a9
    bool ShouldSprintOnStartMoving; // 0x1aa
    char pad_1ab[0x5];
    FTimerHandle ShouldSprintOnStartMovingTimerHandle; // 0x1b0
    float DelayBeforeActionHud; // 0x1b8
    int32_t LoadOutSlot; // 0x1bc
    bool RagdollCriteriaMet; // 0x1c0
    char pad_1c1[0x7];
    FTimerHandle CastFailedTimerHandle; // 0x1c8
    EBTCustomActionType::Type ActionType; // 0x1d0
    char pad_1d1[0x3];
    float InjuryHeight; // 0x1d4
    float DeathHeight; // 0x1d8
    float LastTwitchSpellCastAtTime; // 0x1dc
    FString TakedownTutorialString; // 0x1e0
    int32_t SpellTestIndex; // 0x1f0
    int32_t SpellTestSlot; // 0x1f4
    AActor* SpellTestSpawnedActor; // 0x1f8
    TArray<FString> ItemNameArray; // 0x200
    TArray<FString> SpellNameArray; // 0x210
    FTimerHandle ItemMenuTimerHandle; // 0x220
    FTimerHandle DodgeTimerHandle; // 0x228
    FTimerHandle SprintStopTimerHandle; // 0x230
    FTimerHandle WalkStopTimerHandle; // 0x238
    UUI_BP_GadgetWheel_C* ItemWheelWidget; // 0x240
    float FallHeightAdjust; // 0x248
    bool IsWalking; // 0x24c
    char pad_24d[0x3];
    int32_t SpellWheelActiveSpellIndex; // 0x250
    char pad_254[0x4];
    FTimerHandle WalkStopTimerHandle_Idle; // 0x258
    FTimerHandle FieldGuideTimerHandle; // 0x260
    FTimerHandle OppugnoTimerHandle; // 0x268
    bool ItemMenuButtonHeld; // 0x270
    bool OppugnoButtonHeld; // 0x271
    bool InteractButtonPressed; // 0x272
    bool Stealing; // 0x273
    bool InteractStarted; // 0x274
    bool InteractDebug; // 0x275
    bool StupefyButtonHeld; // 0x276
    bool LockOnButtonHeld; // 0x277
    bool SprintButtonHeld; // 0x278
    char pad_279[0x7];
    ABP_StealthTakedownInteractActor_C* StealthInteractActor; // 0x280
    bool OppugnoSenseEnabled; // 0x288
    bool AimModeActive; // 0x289
    bool AimModeWasStartedInCombat; // 0x28a
    char pad_28b[0x1];
    float LoadoutNextTimeout; // 0x28c
    TArray<FName> ItemPickupLocks; // 0x290
    float BroomcastTime; // 0x2a0
    float BroomcastCooldownDuration; // 0x2a4
    static UBTS_Biped_TopLevel_C* StaticClass();
    void SelectedLockedDiamond(int32_t Current, int32_t NEW, bool CallFunc_NotEqual_IntInt_ReturnValue);
    void IsItemWheelAvailable(bool& IsAvailable, bool FoundItem, int32_t Temp_int_Array_Index_Variable, int32_t Temp_int_Loop_Counter_Variable, int32_t CallFunc_Add_IntInt_ReturnValue, FName CallFunc_Array_Get_Item, int32_t CallFunc_Array_Length_ReturnValue, bool CallFunc_IsUnlocked_ReturnValue, bool CallFunc_Less_IntInt_ReturnValue, bool CallFunc_BooleanOR_ReturnValue);
    void SetNextLightWandCast(bool Casual, AActor* CallFunc_GetActorOwner_ReturnValue, ABiped_Player* K2Node_DynamicCast_AsBiped_Player, bool K2Node_DynamicCast_bSuccess, AWandTool* CallFunc_GetWand_ReturnValue, bool CallFunc_EqualEqual_ClassClass_ReturnValue, bool CallFunc_EqualEqual_ClassClass_ReturnValue_1, bool CallFunc_BooleanOR_ReturnValue);
    void FlushQueuedActions(AActor* Owner);
