#pragma once
#include <cstdint>
#include "EEdGraphPinDirection.hpp"
#include "FEdGraphPinType.hpp"
#include "UObject.hpp"
#pragma pack(push, 1)
class UEdGraphPin_Deprecated : public UObject {
public:
    FString PinName; // 0x28
    FString PinToolTip; // 0x38
    EEdGraphPinDirection Direction; // 0x48
    char pad_49[0x7];
    FEdGraphPinType PinType; // 0x50
    FString DefaultValue; // 0xa8
    FString AutogeneratedDefaultValue; // 0xb8
    UObject* DefaultObject; // 0xc8
    char pad_d0[0x18];
    TArray<UEdGraphPin_Deprecated*> LinkedTo; // 0xe8
    TArray<UEdGraphPin_Deprecated*> SubPins; // 0xf8
    UEdGraphPin_Deprecated* ParentPin; // 0x108
    UEdGraphPin_Deprecated* ReferencePassThroughConnection; // 0x110
    static UEdGraphPin_Deprecated* StaticClass();
}; // Size: 0x118
#pragma pack(pop)
