#pragma once
#include <cstdint>
#include "EFieldGuideExitReasons.hpp"
#include "EInputDeviceUsed.hpp"
#include "EInputEvent.hpp"
#include "ENotificationCategory.hpp"
#include "EPauseMenuPage.hpp"
#include "ESlateVisibility.hpp"
#include "EUMGInputAction.hpp"
#include "FFormatArgumentData.hpp"
#include "FLegendItemData.hpp"
#include "FPointerToUberGraphFrame.hpp"
#include "UFieldGuideMenu.hpp"
class UWidgetAnimation;
class UCanvasPanel;
class UUI_BP_NavBarButton_C;
class UUI_BP_AsyncLoadWrapper_C;
class UImage;
class UPhoenixUserWidget;
class UButton;
class ULegendItem;
class UUI_BP_FG_Index_C;
class UAsyncWidgetSwitcher;
class UUI_BP_Legend_Horizontal_Screen_C;
class UHorizontalBox;
class UTutorialSystem;
class UUIManager;
class UWidget;
class UAsyncLoadWrapper;
class UUI_BP_FG_InventoryScreen_C;
class UUI_BP_FG_SettingsScreen_C;
class USystemMenuWidget;
class UMapSubSystem;
class UUMGSequencePlayer;
class UTabPageWidget;
class ABiped_Player;
class UUserWidget;
class UObject;
#pragma pack(push, 1)
class UUI_BP_FieldGuide_C : public UFieldGuideMenu {
public:
    FPointerToUberGraphFrame UberGraphFrame; // 0x378
    UWidgetAnimation* fadeScrim; // 0x380
    UUI_BP_AsyncLoadWrapper_C* Async_FG_Actions; // 0x388
    UUI_BP_AsyncLoadWrapper_C* Async_FG_Collections; // 0x390
    UUI_BP_AsyncLoadWrapper_C* Async_FG_Gear; // 0x398
    UUI_BP_AsyncLoadWrapper_C* Async_FG_Inventory; // 0x3a0
    UUI_BP_AsyncLoadWrapper_C* Async_FG_Map; // 0x3a8
    UUI_BP_AsyncLoadWrapper_C* Async_FG_OwlMail; // 0x3b0
    UUI_BP_AsyncLoadWrapper_C* Async_FG_Quests; // 0x3b8
    UUI_BP_AsyncLoadWrapper_C* Async_FG_Settings; // 0x3c0
    UUI_BP_AsyncLoadWrapper_C* Async_FG_Talents; // 0x3c8
    UImage* backgroundDim; // 0x3d0
    UImage* backgroundHide; // 0x3d8
    UUI_BP_NavBarButton_C* btn_Actions; // 0x3e0
    UUI_BP_NavBarButton_C* btn_Character; // 0x3e8
    UUI_BP_NavBarButton_C* btn_Collections; // 0x3f0
    UUI_BP_NavBarButton_C* btn_Inventory; // 0x3f8
    UUI_BP_NavBarButton_C* btn_Mail; // 0x400
    UUI_BP_NavBarButton_C* btn_Map; // 0x408
    UUI_BP_NavBarButton_C* btn_Missions; // 0x410
    UUI_BP_NavBarButton_C* btn_Settings; // 0x418
    UUI_BP_NavBarButton_C* btn_Talents; // 0x420
    UUI_BP_FG_Index_C* FG_IndexPage; // 0x428
    UButton* HiddenButtonForHoverEvents; // 0x430
    UUI_BP_Legend_Horizontal_Screen_C* Legend; // 0x438
    UAsyncWidgetSwitcher* MenuWidgetSwitcher; // 0x440
    UCanvasPanel* navBar; // 0x448
    UHorizontalBox* NavBarContainer; // 0x450
    UButton* NavBarLeftButton; // 0x458
    UButton* NavBarRightButton; // 0x460
    bool HiddenButtonHovered; // 0x468
    char pad_469[0x57];
    UUI_BP_NavBarButton_C* SelectedNavBarButton; // 0x4c0
    float DisplayPageDelay; // 0x4c8
    char pad_4cc[0x54];
    bool LockedToPage; // 0x520
    char pad_521[0x7];
    TArray<FString> DestPagePath; // 0x528
    char pad_538[0x50];
    UUI_BP_AsyncLoadWrapper_C* NewPage; // 0x588
    bool isScrimShowing; // 0x590
    char pad_591[0x57];
    bool InMenuTransition; // 0x5e8
    char pad_5e9[0x3];
    int32_t CurrentTabIndex; // 0x5ec
    TArray<ENotificationCategory> NotificationCategories; // 0x5f0
    bool InMapTransition; // 0x600
    char pad_601[0x7];
    static UUI_BP_FieldGuide_C* StaticClass();
    void TerminateLingeringTutorials(UTutorialSystem* CallFunc_Get_ReturnValue, bool CallFunc_ForceCompleteTutorial_ReturnValue, bool CallFunc_ForceCompleteTutorial_ReturnValue_1, bool CallFunc_ForceCompleteTutorial_ReturnValue_2, bool CallFunc_ForceCompleteTutorial_ReturnValue_3, bool CallFunc_ForceCompleteTutorial_ReturnValue_4);
    void DoesTutorialPreventExitingPauseMenu(bool& Prevented, UTutorialSystem* CallFunc_Get_ReturnValue, bool CallFunc_IsTutorialActiveOrAboutToBe_ReturnValue);
    void DoesTutorialPreventBackingOut(bool& Prevented, UTutorialSystem* CallFunc_Get_ReturnValue, bool CallFunc_IsTutorialActiveOrAboutToBe_ReturnValue);
    TArray<FString> GatherMenuReaderStrings(int32_t DepthLevel, TArray<FString> TempGatheredStrings, TArray<FString>& CallFunc_GatherMenuReaderStrings_ReturnValue, TArray<FString>& CallFunc_GatherMenuReaderStrings_ReturnValue_1);
